import React from 'react'
import Link from 'next/link';
import { NavigationMenuTrigger, NavigationMenu, NavigationMenuList, NavigationMenuItem, NavigationMenuContent, NavigationMenuLink } from "@/components/ui/navigation-menu"
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion"



function Lawcate() {
  
  return(
    <article className='rounded-2xl mx-auto mt-10 w-11/12 h-auto bg-[#FFFADF]'>
      
    <div className='flex text-center items-center bg-[#ED9BC8] rounded-t-2xl p-4 h-24'>
      <h1 className=' text-5xl  font-extrabold text-center pl-36 mx-auto'>กฏหมายอาญา</h1>
      <NavigationMenu>
        <NavigationMenuList>
          <NavigationMenuItem>
            <NavigationMenuTrigger><Link href = '/crime/crime1'>ภาค 1 บทบัญญัติทั่วไป</Link></NavigationMenuTrigger>
            <NavigationMenuContent>
              <ul className='flex-col w-48 text-left pl-4 pt-4 mb-5'>
                <li><Link href = '/crime/crime2'>ภาค 2 ความผิด</Link></li>
                <li><Link href = '/crime/crime3'>ภาค 3 ลหุโทษ</Link></li>
              </ul>
            </NavigationMenuContent>
          </NavigationMenuItem>
          
        </NavigationMenuList>
      </NavigationMenu>
    </div>

      <div className='p-8 ml-10 '>
      <h2 className='font-semibold text-3xl'>ลักษณะ 1 บทบัญญัติที่ใช้แก่ความผิดทั่วไป</h2>
          <Accordion type="single" collapsible>
          <AccordionItem value="item-1">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 1 บทนิยาม</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑  ในประมวลกฎหมายนี้</h2>
              <div className='text-lg'>
                    <p>(๑) “โดยทุจริต” หมายความว่า เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น</p>
                    <p>(๒) “ทางสาธารณะ” หมายความว่า ทางบกหรือทางน้ำสำหรับประชาชนใช้ในการจราจร และให้หมายความรวมถึงทางรถไฟและทางรถรางที่มีรถเดิน สำหรับประชาชนโดยสารด้วย</p>
                    <p>(๓) “สาธารณสถาน” หมายความว่า สถานที่ใด ๆ ซึ่งประชาชนมีความชอบธรรมที่จะเข้าไปได้</p>
                    <p>(๔) “เคหสถาน” หมายความว่า ที่ซึ่งใช้เป็นที่อยู่อาศัย เช่น เรือน โรง เรือ หรือแพ ซึ่งคนอยู่อาศัย และให้หมายความรวมถึงบริเวณของที่ซึ่งใช้เป็นที่อยู่อาศัยนั้นด้วย จะมีรั้วล้อมหรือไม่ก็ตาม</p>
                    <p>(๕) “อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ</p>
                    <p>(๖) “ใช้กำลังประทุษร้าย” หมายความว่า ทำการประทุษร้ายแก่กายหรือจิตใจของบุคคล ไม่ว่าจะทำด้วยใช้แรงกายภาพหรือด้วยวิธีอื่นใด และให้หมายความรวมถึงการกระทำใด ๆ ซึ่งเป็นเหตุให้บุคคลหนึ่งบุคคลใดอยู่ในภาวะที่ไม่สามารถขัดขืนได้ ไม่ว่าจะโดยใช้ยาทำให้มึนเมา สะกดจิต หรือใช้วิธีอื่นใดอันคล้ายคลึงกัน</p>
                    <p>(๗) “เอกสาร” หมายความว่า กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผัง หรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ ถ่ายภาพ หรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น</p>
                    <p>(๘) “เอกสารราชการ” หมายความว่า เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย</p>
                    <p>(๙) “เอกสารสิทธิ” หมายความว่า เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ</p>
                    <p>(๑๐) “ลายมือชื่อ” หมายความรวมถึงลายพิมพ์นิ้วมือและเครื่องหมายซึ่งบุคคลลงไว้แทนลายมือชื่อของตน</p>
                    <p>(๑๑) “กลางคืน” หมายความว่า เวลาระหว่างพระอาทิตย์ตกและพระอาทิตย์ขึ้น</p>
                    <p>(๑๒) “คุมขัง” หมายความว่า คุมตัว ควบคุม ขัง กักขังหรือจำคุก</p>
                    <p>(๑๓) “ค่าไถ่” หมายความว่า ทรัพย์สินหรือประโยชน์ที่เรียกเอา หรือให้เพื่อแลกเปลี่ยนเสรีภาพของผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยวหรือผู้ถูกกักขัง</p>
                    <p>(๑๔) “บัตรอิเล็กทรอนิกส์” หมายความว่า</p>
                              <p className='ml-6'>(ก) เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า</p>
                              <p className='ml-6'>(ข) ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ</p>
                              <p className='ml-6'>(ค) สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ</p>
                    <p>(๑๕) “หนังสือเดินทาง” หมายความว่า เอกสารสำคัญประจำตัวไม่ว่าจะมีรูปลักษณะใดที่รัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศออกให้แก่บุคคลใด เพื่อใช้แสดงตนในการเดินทางระหว่างประเทศ และให้หมายความรวมถึงเอกสารใช้แทนหนังสือเดินทางและแบบหนังสือเดินทางที่ยังไม่ได้กรอกข้อความเกี่ยวกับผู้ถือหนังสือเดินทางด้วย</p>
                    <p>(๑๖) “เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่</p>
                    <p>(๑๗) “กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น</p>
              </div>
            </AccordionContent>
          </AccordionItem>
          <AccordionItem value="item-2">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 2 การใช้กฎหมายอาญา</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๒</h2>
              <div className='text-lg'>
                    <p>บุคคลจักต้องรับโทษในทางอาญาต่อเมื่อได้กระทำการอันกฎหมายที่ใช้ในขณะกระทำนั้นบัญญัติเป็นความผิดและกำหนดโทษไว้ และโทษที่จะลงแก่ผู้กระทำความผิดนั้น ต้องเป็นโทษที่บัญญัติไว้ในกฎหมาย</p>
                    <p>ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง การกระทำเช่นนั้นไม่เป็นความผิดต่อไป ให้ผู้ที่ได้กระทำการนั้นพ้นจากการเป็นผู้กระทำความผิด และถ้าได้มีคำพิพากษาถึงที่สุดให้ลงโทษแล้ว ก็ให้ถือว่าผู้นั้นไม่เคยต้องคำพิพากษาว่าได้กระทำความผิดนั้น ถ้ารับโทษอยู่ก็ให้การลงโทษนั้นสิ้นสุดลง</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๓</h2>
              <div className='text-lg'>
                    <p>ถ้ากฎหมายที่ใช้ในขณะกระทำความผิดแตกต่างกับกฎหมายที่ใช้ในภายหลังการกระทำความผิด ให้ใช้กฎหมายในส่วนที่เป็นคุณแก่ผู้กระทำความผิด ไม่ว่าในทางใด เว้นแต่คดีถึงที่สุดแล้ว แต่ในกรณีที่คดีถึงที่สุดแล้ว ดังต่อไปนี้</p>
                    <p>(๑) ถ้าผู้กระทำความผิดยังไม่ได้รับโทษ หรือกำลังรับโทษอยู่ และโทษที่กำหนดตามคำพิพากษาหนักกว่าโทษที่กำหนดตามกฎหมายที่บัญญัติในภายหลัง เมื่อสำนวนความปรากฏแก่ศาลหรือเมื่อผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ ให้ศาลกำหนดโทษเสียใหม่ตามกฎหมายที่บัญญัติในภายหลัง ในการที่ศาลจะกำหนดโทษใหม่นี้ ถ้าปรากฏว่า ผู้กระทำความผิดได้รับโทษมาบ้างแล้ว เมื่อได้คำนึงถึงโทษตามกฎหมายที่บัญญัติในภายหลัง หากเห็นเป็นการสมควร ศาลจะกำหนดโทษน้อยกว่าโทษขั้นต่ำที่กฎหมายที่บัญญัติในภายหลังกำหนดไว้ถ้าหากมีก็ได้ หรือถ้าเห็นว่าโทษที่ผู้กระทำความผิดได้รับมาแล้วเป็นการเพียงพอ ศาลจะปล่อยผู้กระทำความผิดไปก็ได้</p>
                    <p>(๒) ถ้าศาลพิพากษาให้ประหารชีวิตผู้กระทำความผิด และตามกฎหมายที่บัญญัติในภายหลัง โทษที่จะลงแก่ผู้กระทำความผิดไม่ถึงประหารชีวิต ให้งดการประหารชีวิตผู้กระทำความผิด และให้ถือว่าโทษประหารชีวิตตามคำพิพากษาได้เปลี่ยนเป็นโทษสูงสุดที่จะพึงลงได้ตามกฎหมายที่บัญญัติในภายหลัง</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๔</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำความผิดในราชอาณาจักร ต้องรับโทษตามกฎหมาย</p>
                    <p>การกระทำความผิดในเรือไทยหรืออากาศยานไทย ไม่ว่าจะอยู่ ณ ที่ใด ให้ถือว่ากระทำความผิดในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'> มาตรา ๕</h2>
              <div className='text-lg'>
                    <p>ความผิดใดที่การกระทำแม้แต่ส่วนหนึ่งส่วนใดได้กระทำในราชอาณาจักรก็ดี ผลแห่งการกระทำเกิดในราชอาณาจักรโดยผู้กระทำประสงค์ให้ผลนั้นเกิดในราชอาณาจักร หรือโดยลักษณะแห่งการกระทำ ผลที่เกิดขึ้นนั้นควรเกิดในราชอาณาจักรหรือย่อมจะเล็งเห็นได้ว่าผลนั้นจะเกิดในราชอาณาจักรก็ดี ให้ถือว่าความผิดนั้นได้กระทำในราชอาณาจักร</p>
                    <p>ในกรณีการตระเตรียมการ หรือพยายามกระทำการใดซึ่งกฎหมายบัญญัติเป็นความผิด แม้การกระทำนั้นจะได้กระทำนอกราชอาณาจักร ถ้าหากการกระทำนั้นจะได้กระทำตลอดไปจนถึงขั้นความผิดสำเร็จ ผลจะเกิดขึ้นในราชอาณาจักร ให้ถือว่า การตระเตรียมการหรือพยายามกระทำความผิดนั้นได้กระทำในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'> มาตรา ๖</h2>
              <div className='text-lg'>
                    <p>ความผิดใดที่ได้กระทำในราชอาณาจักรหรือที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร แม้การกระทำของผู้เป็นตัวการด้วยกัน ของผู้สนับสนุน หรือของผู้ใช้ให้กระทำความผิดนั้นจะได้กระทำนอกราชอาณาจักร ก็ให้ถือว่าตัวการ ผู้สนับสนุน หรือผู้ใช้ให้กระทำได้กระทำในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๗</h2>
              <div className='text-lg'>
                    <p>(๑) ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๒๙</p>
                    <p>(๑/๑)๑ ความผิดเกี่ยวกับการก่อการร้ายตามที่บัญญัติไว้ในมาตรา ๑๓๕/๑ มาตรา ๑๓๕/๒ มาตรา ๑๓๕/๓ และมาตรา ๑๓๕/๔</p>
                    <p>(๒) ความผิดเกี่ยวกับการปลอมและการแปลง ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ และมาตรา ๒๖๖ (๓) และ (๔)</p>
                    <p>(๒ ทวิ)๒ ความผิดเกี่ยวกับเพศตามที่บัญญัติไว้ในมาตรา ๒๘๒ และมาตรา ๒๘๓</p>
                    <p>(๓) ความผิดฐานชิงทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๙ และความผิดฐานปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๔๐ ซึ่งได้กระทำในทะเลหลวง</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๘</h2>
              <div className='text-lg'>
                    <p>(ก) ผู้กระทำความผิดนั้นเป็นคนไทย และรัฐบาลแห่งประเทศที่ความผิดได้เกิดขึ้น หรือผู้เสียหายได้ร้องขอให้ลงโทษ หรือ</p>
                    <p>(ข) ผู้กระทำความผิดนั้นเป็นคนต่างด้าว และรัฐบาลไทยหรือคนไทยเป็นผู้เสียหาย และผู้เสียหายได้ร้องขอให้ลงโทษ</p>
                    <p className='ml-6'>ถ้าความผิดนั้นเป็นความผิดดังระบุไว้ต่อไปนี้ จะต้องรับโทษภายในราชอาณาจักร คือ</p>
                    <p>(๑) ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๑ ถึงมาตรา ๒๒๓  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๒๐ วรรคแรก และมาตรา ๒๒๔ มาตรา ๒๒๖ มาตรา ๒๒๘ ถึงมาตรา ๒๓๒ มาตรา ๒๓๗ และมาตรา ๒๓๓ ถึงมาตรา ๒๓๖  ทั้งนี้ เฉพาะเมื่อเป็นกรณีต้องระวางโทษตามมาตรา ๒๓๘</p>
                    <p>(๒) ความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ (๑) และ (๒) มาตรา ๒๖๘  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๖๗ และมาตรา ๒๖๙</p>
                    <p>(๒/๑)๓ ความผิดเกี่ยวกับบัตรอิเล็กทรอนิกส์ตามที่บัญญัติไว้ในมาตรา ๒๖๙/๑ ถึงมาตรา ๒๖๙/๗</p>
                    <p>(๒/๒)๔ ความผิดเกี่ยวกับหนังสือเดินทางตามที่บัญญัติไว้ในมาตรา ๒๖๙/๘ ถึงมาตรา ๒๖๙/๑๕</p>
                    <p>(๓) ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ มาตรา ๒๘๐ และมาตรา ๒๘๕  ทั้งนี้ เฉพาะที่เกี่ยวกับมาตรา ๒๗๖</p>
                    <p>(๔) ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐</p>
                    <p>(๕) ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๘</p>
                    <p>(๖) ความผิดฐานทอดทิ้งเด็ก คนป่วยเจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘</p>
                    <p>(๗) ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ มาตรา ๓๑๒ ถึงมาตรา ๓๑๕ และมาตรา ๓๑๗ ถึงมาตรา ๓๒๐</p>
                    <p>(๘) ความผิดฐานลักทรัพย์และวิ่งราวทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖</p>
                    <p>(๙) ความผิดฐานกรรโชก รีดเอาทรัพย์ ชิงทรัพย์ และปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๗ ถึงมาตรา ๓๔๐</p>
                    <p>(๑๐) ความผิดฐานฉ้อโกง ตามที่บัญญัติไว้ในมาตรา ๓๔๑ ถึงมาตรา ๓๔๔ มาตรา ๓๔๖ และมาตรา ๓๔๗</p>
                    <p>(๑๑) ความผิดฐานยักยอก ตามที่บัญญัติไว้ในมาตรา ๓๕๒ ถึงมาตรา ๓๕๔</p>
                    <p>(๑๒) ความผิดฐานรับของโจร ตามที่บัญญัติไว้ในมาตรา ๓๕๗</p>
                    <p>(๑๓) ความผิดฐานทำให้เสียทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๕๘ ถึงมาตรา ๓๖๐</p>
              </div>
            </AccordionContent>
            </AccordionItem>
            <AccordionItem value="item-3">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 3 โทษและวิธีการเพื่อความปลอดภัย</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium text-xl'>ส่วนที่ ๑ โทษ</h2>
              <h2 className='text-lg font-medium'>มาตรา ๑๘  โทษสำหรับลงแก่ผู้กระทำความผิดมีดังนี้</h2>
              <div className='text-lg'>
                    <p>(๑) ประหารชีวิต</p>
                    <p>(๒) จำคุก</p>
                    <p>(๓) กักขัง</p>
                    <p>(๔) ปรับ</p>
                    <p>(๕) ริบทรัพย์สิน</p>
                    <p>โทษประหารชีวิตและโทษจำคุกตลอดชีวิตมิให้นำมาใช้บังคับแก่ผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปี๑</p>
                    <p>ในกรณีผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปีได้กระทำความผิดที่มีระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต ให้ถือว่าระวางโทษดังกล่าวได้เปลี่ยนเป็นระวางโทษจำคุกห้าสิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๙</h2>
              <div className='text-lg'>
                    <p>ผู้ใดต้องโทษประหารชีวิต ให้ดำเนินการด้วยวิธีฉีดยาหรือสารพิษให้ตาย</p>
                    <p>หลักเกณฑ์และวิธีการประหารชีวิต ให้เป็นไปตามระเบียบที่กระทรวงยุติธรรมกำหนด โดยประกาศในราชกิจจานุเบกษา</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๒๐</h2>
              <div className='text-lg'>
                    <p>บรรดาความผิดที่กฎหมายกำหนดให้ลงโทษทั้งจำคุกและปรับด้วยนั้น ถ้าศาลเห็นสมควรจะลงแต่โทษจำคุกก็ได้</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-4">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 4 ความรับผิดในทางอาญา</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-5">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 5 การพยายามกระทำความผิด</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-6">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 6 ตัวการและผู้สนับสนุน</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-7">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 7 การกระทำความผิดหลายบทหรือหลายกระทง</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-8">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 8 การกระทำความผิดอีก</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-9">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 9 อายุความ</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๕๙</h2>
              <div className='text-lg'>
                    <p>บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา</p>
                    <p>กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น</p>
                    <p>ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้</p>
                    <p>กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่</p>
                    <p>การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๖๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
          </AccordionItem>
        </Accordion>
      </div>
    </article>
    
  );

}

export default Lawcate
