import React from 'react'
import Link from 'next/link'
import { NavigationMenuTrigger, NavigationMenu, NavigationMenuList, NavigationMenuItem, NavigationMenuContent, NavigationMenuLink } from "@/components/ui/navigation-menu"
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion"

function CrimeP2() {
  return (
    <article className='rounded-2xl mx-auto mt-10 w-11/12 h-auto bg-[#FFFADF]'>
      
    <div className='flex text-center items-center bg-[#ED9BC8] rounded-t-2xl p-4 h-24'>
      <h1 className=' text-5xl  font-extrabold text-center pl-36 mx-auto'>กฏหมายอาญา</h1>
      <NavigationMenu>
        <NavigationMenuList>
          <NavigationMenuItem>
            <NavigationMenuTrigger><Link href = '/crime/crime2'>ภาค 2 ความผิด</Link></NavigationMenuTrigger>
            <NavigationMenuContent>
              <ul className='flex-col w-48 text-left pl-4 pt-4 mb-5'>
                <li><Link href = '/crime/crime1'>ภาค 1 บทบัญญัติทั่วไป</Link></li>
                <li><Link href = '/crime/crime3'>ภาค 3 ลหุโทษ</Link></li>
              </ul>
            </NavigationMenuContent>
          </NavigationMenuItem>
          
        </NavigationMenuList>
      </NavigationMenu>
    </div>

    <div className='p-8 ml-10 '>
      <h2 className='font-semibold text-3xl'>ลักษณะ 1 ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร</h2>
          <Accordion type="single" collapsible>
          <AccordionItem value="item-1">
            <AccordionTrigger className='pb-2 pt-2 m-3 font-semibold text-xl'>หมวด 1 ความผิดต่อองค์พระมหากษัตริย์ พระราชินี รัชทายาท และผู้สำเร็จราชการแทนพระองค์</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'> มาตรา ๑๐๗</h2>
              <div className='text-lg'>
                    <p>ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระมหากษัตริย์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระมหากษัตริย์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตลอดชีวิต</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๐๘ </h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระมหากษัตริย์ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์ ผู้กระทำต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระมหากษัตริย์ หรือรู้ว่ามีผู้จะกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระมหากษัตริย์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๐๙</h2>
              <div className='text-lg'>
                    <p>ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระราชินีหรือรัชทายาท หรือเพื่อฆ่าผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระราชินีหรือรัชทายาท หรือจะฆ่าผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๑๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์หรือชีวิต ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือประทุษร้ายต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
            </AccordionContent>
          </AccordionItem>
          <AccordionItem value="item-2">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 2 ความผิดต่อความมั่นคงของรัฐภายในราชอาณาจักร</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๑๓</h2>
              <div className='text-lg'>
                    <p>ผู้ใดใช้กำลังประทุษร้าย หรือขู่เข็ญว่าจะใช้กำลังประทุษร้าย เพื่อ</p>
                    <p>(๑) ล้มล้างหรือเปลี่ยนแปลงรัฐธรรมนูญ</p>
                    <p>(๒) ล้มล้างอำนาจนิติบัญญัติ อำนาจบริหาร หรืออำนาจตุลาการแห่งรัฐธรรมนูญ หรือให้ใช้อำนาจดังกล่าวแล้วไม่ได้ หรือ</p>
                    <p>(๓) แบ่งแยกราชอาณาจักรหรือยึดอำนาจปกครองในส่วนหนึ่งส่วนใดแห่งราชอาณาจักร</p>
                    <p>ผู้นั้นกระทำความผิดฐานเป็นกบฏ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๑๑๔</h2>
              <div className='text-lg'>
                    <p>ถ้ากฎหมายที่ใช้ในขณะกระทำความผิดแตกต่างกับกฎหมายที่ใช้ในภายหลังการกระทำความผิด ให้ใช้กฎหมายในส่วนที่เป็นคุณแก่ผู้กระทำความผิด ไม่ว่าในทางใด เว้นแต่คดีถึงที่สุดแล้ว แต่ในกรณีที่คดีถึงที่สุดแล้ว ดังต่อไปนี้</p>
                    <p>(๑) ถ้าผู้กระทำความผิดยังไม่ได้รับโทษ หรือกำลังรับโทษอยู่ และโทษที่กำหนดตามคำพิพากษาหนักกว่าโทษที่กำหนดตามกฎหมายที่บัญญัติในภายหลัง เมื่อสำนวนความปรากฏแก่ศาลหรือเมื่อผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ ให้ศาลกำหนดโทษเสียใหม่ตามกฎหมายที่บัญญัติในภายหลัง ในการที่ศาลจะกำหนดโทษใหม่นี้ ถ้าปรากฏว่า ผู้กระทำความผิดได้รับโทษมาบ้างแล้ว เมื่อได้คำนึงถึงโทษตามกฎหมายที่บัญญัติในภายหลัง หากเห็นเป็นการสมควร ศาลจะกำหนดโทษน้อยกว่าโทษขั้นต่ำที่กฎหมายที่บัญญัติในภายหลังกำหนดไว้ถ้าหากมีก็ได้ หรือถ้าเห็นว่าโทษที่ผู้กระทำความผิดได้รับมาแล้วเป็นการเพียงพอ ศาลจะปล่อยผู้กระทำความผิดไปก็ได้</p>
                    <p>(๒) ถ้าศาลพิพากษาให้ประหารชีวิตผู้กระทำความผิด และตามกฎหมายที่บัญญัติในภายหลัง โทษที่จะลงแก่ผู้กระทำความผิดไม่ถึงประหารชีวิต ให้งดการประหารชีวิตผู้กระทำความผิด และให้ถือว่าโทษประหารชีวิตตามคำพิพากษาได้เปลี่ยนเป็นโทษสูงสุดที่จะพึงลงได้ตามกฎหมายที่บัญญัติในภายหลัง</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๑๑๕</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำความผิดในราชอาณาจักร ต้องรับโทษตามกฎหมาย</p>
                    <p>การกระทำความผิดในเรือไทยหรืออากาศยานไทย ไม่ว่าจะอยู่ ณ ที่ใด ให้ถือว่ากระทำความผิดในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๑๑๖</h2>
              <div className='text-lg'>
                    <p>ความผิดใดที่การกระทำแม้แต่ส่วนหนึ่งส่วนใดได้กระทำในราชอาณาจักรก็ดี ผลแห่งการกระทำเกิดในราชอาณาจักรโดยผู้กระทำประสงค์ให้ผลนั้นเกิดในราชอาณาจักร หรือโดยลักษณะแห่งการกระทำ ผลที่เกิดขึ้นนั้นควรเกิดในราชอาณาจักรหรือย่อมจะเล็งเห็นได้ว่าผลนั้นจะเกิดในราชอาณาจักรก็ดี ให้ถือว่าความผิดนั้นได้กระทำในราชอาณาจักร</p>
                    <p>ในกรณีการตระเตรียมการ หรือพยายามกระทำการใดซึ่งกฎหมายบัญญัติเป็นความผิด แม้การกระทำนั้นจะได้กระทำนอกราชอาณาจักร ถ้าหากการกระทำนั้นจะได้กระทำตลอดไปจนถึงขั้นความผิดสำเร็จ ผลจะเกิดขึ้นในราชอาณาจักร ให้ถือว่า การตระเตรียมการหรือพยายามกระทำความผิดนั้นได้กระทำในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๑๑๗</h2>
              <div className='text-lg'>
                    <p>ความผิดใดที่ได้กระทำในราชอาณาจักรหรือที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร แม้การกระทำของผู้เป็นตัวการด้วยกัน ของผู้สนับสนุน หรือของผู้ใช้ให้กระทำความผิดนั้นจะได้กระทำนอกราชอาณาจักร ก็ให้ถือว่าตัวการ ผู้สนับสนุน หรือผู้ใช้ให้กระทำได้กระทำในราชอาณาจักร</p>
              </div>
              <h2 className='text-lg font-medium mt-2'>มาตรา ๑๑๘</h2>
              <div className='text-lg'>
                    <p>(๑) ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๒๙</p>
                    <p>(๑/๑)๑ ความผิดเกี่ยวกับการก่อการร้ายตามที่บัญญัติไว้ในมาตรา ๑๓๕/๑ มาตรา ๑๓๕/๒ มาตรา ๑๓๕/๓ และมาตรา ๑๓๕/๔</p>
                    <p>(๒) ความผิดเกี่ยวกับการปลอมและการแปลง ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ และมาตรา ๒๖๖ (๓) และ (๔)</p>
                    <p>(๒ ทวิ)๒ ความผิดเกี่ยวกับเพศตามที่บัญญัติไว้ในมาตรา ๒๘๒ และมาตรา ๒๘๓</p>
                    <p>(๓) ความผิดฐานชิงทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๙ และความผิดฐานปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๔๐ ซึ่งได้กระทำในทะเลหลวง</p>
              </div>
            </AccordionContent>
            </AccordionItem>
            <AccordionItem value="item-3">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 3 ความผิดต่อความมั่นคงของรัฐภายนอกราชอาณาจักร</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๑๙</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการใด ๆ เพื่อให้ราชอาณาจักรหรือส่วนหนึ่งส่วนใดของราชอาณาจักรตกไปอยู่ใต้อำนาจอธิปไตยของรัฐต่างประเทศ หรือเพื่อให้เอกราชของรัฐเสื่อมเสียไป ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๒๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดคบคิดกับบุคคลซึ่งกระทำการเพื่อประโยชน์ของรัฐต่างประเทศ ด้วยความประสงค์ที่จะก่อให้เกิดการดำเนินการรบต่อรัฐ หรือในทางอื่นที่เป็นปรปักษ์ต่อรัฐ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๒๑</h2>
              <div className='text-lg'>
                    <p>คนไทยคนใดกระทำการรบต่อประเทศหรือเข้าร่วมเป็นข้าศึกของประเทศ ต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๒๒</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการใด ๆ เพื่ออุปการะแก่การดำเนินการรบหรือการตระเตรียมการรบของข้าศึก ต้องระวางโทษจำคุกตั้งแต่ห้าปีถึงสิบห้าปี</p>
                    <p>ถ้าการอุปการะนั้นเป็นการ</p>
                    <p>(๑) ทำให้ป้อม ค่าย สนามบิน ยานรบ ยานพาหนะ ทางคมนาคม สิ่งที่ใช้ในการสื่อสาร ยุทธภัณฑ์ เสบียงอาหาร อู่เรือ อาคาร หรือสิ่งอื่นใดสำหรับใช้เพื่อการสงครามใช้การไม่ได้หรือตกไปอยู่ในเงื้อมมือของข้าศึก</p>
                    <p>(๒) ยุยงทหารให้ละเลยไม่กระทำการตามหน้าที่ ก่อการกำเริบ หนีราชการหรือละเมิดวินัย</p>
                    <p>(๓) กระทำจารกรรม นำหรือแนะทางให้ข้าศึก หรือ</p>
                    <p>(๔) กระทำโดยประการอื่นใดให้ข้าศึกได้เปรียบในการรบ</p>
                    <p>ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๒๓</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการใด ๆ เพื่อให้ได้มาซึ่งข้อความเอกสารหรือสิ่งใด ๆ อันปกปิดไว้เป็นความลับสำหรับความปลอดภัยของประเทศ ต้องระวางโทษจำคุกไม่เกินสิบปี</p>
              </div>
            </AccordionContent>
          </AccordionItem>
            <AccordionItem value="item-4">
            <AccordionTrigger className='pb-2 pt-2 m-3 text-center font-semibold text-xl'>หมวด 4 ความผิดต่อสัมพันธไมตรีกับต่างประเทศ</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๓๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดทำร้ายร่างกายหรือประทุษร้ายต่อเสรีภาพของราชาธิบดี ราชินี ราชสามี รัชทายาทหรือประมุขแห่งรัฐต่างประเทศ ซึ่งมีสัมพันธไมตรี ต้องระวางโทษจำคุกตั้งแต่หนึ่งปีถึงสิบห้าปี</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๒</h2>
              <div className='text-lg'>
                    <p>ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่</p>
              </div>
            </AccordionContent>
            </AccordionItem>
        </Accordion>
      </div>
    <div className='p-8 ml-10 '>
          <Accordion type="single" collapsible>
          <AccordionItem value="item-1">
            <AccordionTrigger className='pb-2 pt-2 m-3 font-semibold text-3xl'><h2>ลักษณะ 1/1 ความผิดเกี่ยวกับการก่อการร้าย</h2></AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๓๕/๑</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการอันเป็นความผิดอาญาดังต่อไปนี้</p>
                    <p>(๑) ใช้กำลังประทุษร้าย หรือกระทำการใดอันก่อให้เกิดอันตรายต่อชีวิต หรืออันตรายอย่างร้ายแรงต่อร่างกาย หรือเสรีภาพของบุคคลใด ๆ</p>
                    <p>(๒) กระทำการใดอันก่อให้เกิดความเสียหายอย่างร้ายแรงแก่ระบบการขนส่งสาธารณะ ระบบโทรคมนาคม หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะ</p>
                    <p>(๓) กระทำการใดอันก่อให้เกิดความเสียหายแก่ทรัพย์สินของรัฐหนึ่งรัฐใด หรือของบุคคลใด หรือต่อสิ่งแวดล้อม อันก่อให้เกิดหรือน่าจะก่อให้เกิดความเสียหายทางเศรษฐกิจอย่างสำคัญ</p>
                    <p>ถ้าการกระทำนั้นได้กระทำโดยมีความมุ่งหมายเพื่อขู่เข็ญหรือบังคับรัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศ ให้กระทำหรือไม่กระทำการใดอันจะก่อให้เกิดความเสียหายอย่างร้ายแรง หรือเพื่อสร้างความปั่นป่วนโดยให้เกิดความหวาดกลัวในหมู่ประชาชน ผู้นั้นกระทำความผิดฐานก่อการร้าย ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงหนึ่งล้านบาท</p>
                    <p>การกระทำในการเดินขบวน ชุมนุม ประท้วง โต้แย้ง หรือเคลื่อนไหวเพื่อเรียกร้องให้รัฐช่วยเหลือหรือให้ได้รับความเป็นธรรมอันเป็นการใช้เสรีภาพตามรัฐธรรมนูญ ไม่เป็นการกระทำความผิดฐานก่อการร้าย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๕/๒</h2>
              <div className='text-lg'>
                    <p>(๑) ขู่เข็ญว่าจะกระทำการก่อการร้าย โดยมีพฤติการณ์อันควรเชื่อได้ว่าบุคคลนั้นจะกระทำการตามที่ขู่เข็ญจริง หรือ</p>
                    <p>(๒) สะสมกำลังพลหรืออาวุธ จัดหาหรือรวบรวมทรัพย์สิน ให้หรือรับการฝึกการก่อการร้าย ตระเตรียมการอื่นใด หรือสมคบกัน เพื่อก่อการร้าย หรือกระทำความผิดใด ๆ อันเป็นส่วนของแผนการเพื่อก่อการร้าย หรือยุยงประชาชนให้เข้ามีส่วนในการก่อการร้าย หรือรู้ว่ามีผู้จะก่อการร้ายแล้วกระทำการใดอันเป็นการช่วยปกปิดไว้</p>
                    <p>ผู้นั้นต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๕/๓</h2>
              <div className='text-lg'>
                    <p>ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระราชินีหรือรัชทายาท หรือเพื่อฆ่าผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระราชินีหรือรัชทายาท หรือจะฆ่าผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๕/๔</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์หรือชีวิต ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือประทุษร้ายต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
            </AccordionContent>
          </AccordionItem>
        </Accordion>
      </div>
    <div className='p-8 ml-10 '>
    <h2 className='font-semibold text-3xl'>ลักษณะ 2 ความผิดเกี่ยวกับการปกครอง</h2>
          <Accordion type="single" collapsible>
          <AccordionItem value="item-1">
            <AccordionTrigger className='pb-2 pt-2 m-3 font-semibold text-xl'>หมวด 1 ความผิดต่อเจ้าพนักงาน</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๓๖</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการอันเป็นความผิดอาญาดังต่อไปนี้</p>
                    <p>(๑) ใช้กำลังประทุษร้าย หรือกระทำการใดอันก่อให้เกิดอันตรายต่อชีวิต หรืออันตรายอย่างร้ายแรงต่อร่างกาย หรือเสรีภาพของบุคคลใด ๆ</p>
                    <p>(๒) กระทำการใดอันก่อให้เกิดความเสียหายอย่างร้ายแรงแก่ระบบการขนส่งสาธารณะ ระบบโทรคมนาคม หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะ</p>
                    <p>(๓) กระทำการใดอันก่อให้เกิดความเสียหายแก่ทรัพย์สินของรัฐหนึ่งรัฐใด หรือของบุคคลใด หรือต่อสิ่งแวดล้อม อันก่อให้เกิดหรือน่าจะก่อให้เกิดความเสียหายทางเศรษฐกิจอย่างสำคัญ</p>
                    <p>ถ้าการกระทำนั้นได้กระทำโดยมีความมุ่งหมายเพื่อขู่เข็ญหรือบังคับรัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศ ให้กระทำหรือไม่กระทำการใดอันจะก่อให้เกิดความเสียหายอย่างร้ายแรง หรือเพื่อสร้างความปั่นป่วนโดยให้เกิดความหวาดกลัวในหมู่ประชาชน ผู้นั้นกระทำความผิดฐานก่อการร้าย ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงหนึ่งล้านบาท</p>
                    <p>การกระทำในการเดินขบวน ชุมนุม ประท้วง โต้แย้ง หรือเคลื่อนไหวเพื่อเรียกร้องให้รัฐช่วยเหลือหรือให้ได้รับความเป็นธรรมอันเป็นการใช้เสรีภาพตามรัฐธรรมนูญ ไม่เป็นการกระทำความผิดฐานก่อการร้าย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๗</h2>
              <div className='text-lg'>
                    <p>(๑) ขู่เข็ญว่าจะกระทำการก่อการร้าย โดยมีพฤติการณ์อันควรเชื่อได้ว่าบุคคลนั้นจะกระทำการตามที่ขู่เข็ญจริง หรือ</p>
                    <p>(๒) สะสมกำลังพลหรืออาวุธ จัดหาหรือรวบรวมทรัพย์สิน ให้หรือรับการฝึกการก่อการร้าย ตระเตรียมการอื่นใด หรือสมคบกัน เพื่อก่อการร้าย หรือกระทำความผิดใด ๆ อันเป็นส่วนของแผนการเพื่อก่อการร้าย หรือยุยงประชาชนให้เข้ามีส่วนในการก่อการร้าย หรือรู้ว่ามีผู้จะก่อการร้ายแล้วกระทำการใดอันเป็นการช่วยปกปิดไว้</p>
                    <p>ผู้นั้นต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๘</h2>
              <div className='text-lg'>
                    <p>ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระราชินีหรือรัชทายาท หรือเพื่อฆ่าผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระราชินีหรือรัชทายาท หรือจะฆ่าผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๓๙</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์หรือชีวิต ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือประทุษร้ายต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
            </AccordionContent>
          </AccordionItem>
          <AccordionItem value="item-2">
            <AccordionTrigger className='pb-2 pt-2 m-3 font-semibold text-xl'>หมวด 2 ความผิดต่อตำแหน่งหน้าที่ราชการ</AccordionTrigger>
            <AccordionContent>
              <h2 className='text-lg font-medium'>มาตรา ๑๔๗</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการอันเป็นความผิดอาญาดังต่อไปนี้</p>
                    <p>(๑) ใช้กำลังประทุษร้าย หรือกระทำการใดอันก่อให้เกิดอันตรายต่อชีวิต หรืออันตรายอย่างร้ายแรงต่อร่างกาย หรือเสรีภาพของบุคคลใด ๆ</p>
                    <p>(๒) กระทำการใดอันก่อให้เกิดความเสียหายอย่างร้ายแรงแก่ระบบการขนส่งสาธารณะ ระบบโทรคมนาคม หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะ</p>
                    <p>(๓) กระทำการใดอันก่อให้เกิดความเสียหายแก่ทรัพย์สินของรัฐหนึ่งรัฐใด หรือของบุคคลใด หรือต่อสิ่งแวดล้อม อันก่อให้เกิดหรือน่าจะก่อให้เกิดความเสียหายทางเศรษฐกิจอย่างสำคัญ</p>
                    <p>ถ้าการกระทำนั้นได้กระทำโดยมีความมุ่งหมายเพื่อขู่เข็ญหรือบังคับรัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศ ให้กระทำหรือไม่กระทำการใดอันจะก่อให้เกิดความเสียหายอย่างร้ายแรง หรือเพื่อสร้างความปั่นป่วนโดยให้เกิดความหวาดกลัวในหมู่ประชาชน ผู้นั้นกระทำความผิดฐานก่อการร้าย ต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกตั้งแต่สามปีถึงยี่สิบปี และปรับตั้งแต่หกหมื่นบาทถึงหนึ่งล้านบาท</p>
                    <p>การกระทำในการเดินขบวน ชุมนุม ประท้วง โต้แย้ง หรือเคลื่อนไหวเพื่อเรียกร้องให้รัฐช่วยเหลือหรือให้ได้รับความเป็นธรรมอันเป็นการใช้เสรีภาพตามรัฐธรรมนูญ ไม่เป็นการกระทำความผิดฐานก่อการร้าย</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๔๘</h2>
              <div className='text-lg'>
                    <p>(๑) ขู่เข็ญว่าจะกระทำการก่อการร้าย โดยมีพฤติการณ์อันควรเชื่อได้ว่าบุคคลนั้นจะกระทำการตามที่ขู่เข็ญจริง หรือ</p>
                    <p>(๒) สะสมกำลังพลหรืออาวุธ จัดหาหรือรวบรวมทรัพย์สิน ให้หรือรับการฝึกการก่อการร้าย ตระเตรียมการอื่นใด หรือสมคบกัน เพื่อก่อการร้าย หรือกระทำความผิดใด ๆ อันเป็นส่วนของแผนการเพื่อก่อการร้าย หรือยุยงประชาชนให้เข้ามีส่วนในการก่อการร้าย หรือรู้ว่ามีผู้จะก่อการร้ายแล้วกระทำการใดอันเป็นการช่วยปกปิดไว้</p>
                    <p>ผู้นั้นต้องระวางโทษจำคุกตั้งแต่สองปีถึงสิบปี และปรับตั้งแต่สี่หมื่นบาทถึงสองแสนบาท</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๔๙</h2>
              <div className='text-lg'>
                    <p>ผู้ใดปลงพระชนม์พระมหากษัตริย์ ต้องระวางโทษประหารชีวิต</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อปลงพระชนม์พระราชินีหรือรัชทายาท หรือเพื่อฆ่าผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะปลงพระชนม์พระราชินีหรือรัชทายาท หรือจะฆ่าผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
              <h2 className='text-lg font-medium mt-3'>มาตรา ๑๕๐</h2>
              <div className='text-lg'>
                    <p>ผู้ใดกระทำการประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ ต้องระวางโทษจำคุกตลอดชีวิต หรือจำคุกตั้งแต่สิบหกปีถึงยี่สิบปี</p>
                    <p>ผู้ใดพยายามกระทำการเช่นว่านั้น ต้องระวางโทษเช่นเดียวกัน</p>
                    <p>ถ้าการกระทำนั้นมีลักษณะอันน่าจะเป็นอันตรายแก่พระชนม์หรือชีวิต ผู้กระทำต้องระวางโทษประหารชีวิต หรือจำคุกตลอดชีวิต</p>
                    <p>ผู้ใดกระทำการใดอันเป็นการตระเตรียมเพื่อประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ หรือรู้ว่ามีผู้จะประทุษร้ายต่อพระองค์ หรือเสรีภาพของพระราชินีหรือรัชทายาท หรือประทุษร้ายต่อร่างกายหรือเสรีภาพของผู้สำเร็จราชการแทนพระองค์ กระทำการใดอันเป็นการช่วยปกปิดไว้ ต้องระวางโทษจำคุกตั้งแต่สิบสองปีถึงยี่สิบปี</p>
              </div>
            </AccordionContent>
          </AccordionItem>
        </Accordion>
      </div>
    </article>
  )
}

export default CrimeP2