{
    {
        "lawType": "crime",
        "part": "ภาค 1 บทบัญญัติทั่วไป",
        "category": "ลักษณะ 1 บทบัญญัติที่ใช้แก่ความผิดทั่วไป",
        "sections": [
            {
                "sectionTitle": "หมวด 1 บทนิยาม",
                "subsections": [
                    {
                        "subsectionTitle": "มาตรา 1",
                        "articles": [
                            {
                                "articleNumber": "มาตรา 1",
                                "description": "ในประมวลกฎหมายนี้",
                                "splitSections":[
                                    {
                                        "partTitle": "(1)",
                                        "content": "“โดยทุจริต” หมายความว่า เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "“ทางสาธารณะ” หมายความว่า ทางบกหรือทางน้ำสำหรับประชาชนใช้ในการจราจร และให้หมายความรวมถึงทางรถไฟและทางรถรางที่มีรถเดิน สำหรับประชาชนโดยสารด้วย"
                                    },
                                    {
                                        "partTitle": "(3)",
                                        "content": "“สาธารณสถาน” หมายความว่า สถานที่ใด ๆ ซึ่งประชาชนมีความชอบธรรมที่จะเข้าไปได้"
                                    },
                                    {
                                        "partTitle": "(4)",
                                        "content": "“เคหสถาน” หมายความว่า ที่ซึ่งใช้เป็นที่อยู่อาศัย เช่น เรือน โรง เรือ หรือแพ ซึ่งคนอยู่อาศัย และให้หมายความรวมถึงบริเวณของที่ซึ่งใช้เป็นที่อยู่อาศัยนั้นด้วย จะมีรั้วล้อมหรือไม่ก็ตาม"
                                    },
                                    {
                                        "partTitle": "(5)",
                                        "content": "“อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ"
                                    },
                                    {
                                        "partTitle": "(6)",
                                        "content": "“ใช้กำลังประทุษร้าย” หมายความว่า ทำการประทุษร้ายแก่กายหรือจิตใจของบุคคล ไม่ว่าจะทำด้วยใช้แรงกายภาพหรือด้วยวิธีอื่นใด และให้หมายความรวมถึงการกระทำใด ๆ ซึ่งเป็นเหตุให้บุคคลหนึ่งบุคคลใดอยู่ในภาวะที่ไม่สามารถขัดขืนได้ ไม่ว่าจะโดยใช้ยาทำให้มึนเมา สะกดจิต หรือใช้วิธีอื่นใดอันคล้ายคลึงกัน"
                                    },
                                    {
                                        "partTitle": "(7)",
                                        "content": "“เอกสาร” หมายความว่า กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผัง หรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ ถ่ายภาพ หรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น"
                                    },
                                    {
                                        "partTitle": "(8)",
                                        "content": "“เอกสารราชการ” หมายความว่า เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย"
                                    },
                                    {
                                        "partTitle": "(9)",
                                        "content": "“เอกสารสิทธิ” หมายความว่า เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ"
                                    },
                                    {
                                        "partTitle": "(10)",
                                        "content": "“ลายมือชื่อ” หมายความรวมถึงลายพิมพ์นิ้วมือและเครื่องหมายซึ่งบุคคลลงไว้แทนลายมือชื่อของตน"
                                    },
                                    {
                                        "partTitle": "(11)",
                                        "content": "“กลางคืน” หมายความว่า เวลาระหว่างพระอาทิตย์ตกและพระอาทิตย์ขึ้น"
                                    },
                                    {
                                        "partTitle": "(12)",
                                        "content": "“คุมขัง” หมายความว่า คุมตัว ควบคุม ขัง กักขังหรือจำคุก"
                                    },
                                    {
                                        "partTitle": "(13)",
                                        "content": "“ค่าไถ่” หมายความว่า ทรัพย์สินหรือประโยชน์ที่เรียกเอา หรือให้เพื่อแลกเปลี่ยนเสรีภาพของผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยวหรือผู้ถูกกักขัง"
                                    },
                                    {
                                        "partTitle": "(14)",
                                        "content": "“บัตรอิเล็กทรอนิกส์” หมายความว่า",
                                        "splitSection": [
                                            {
                                                "partTitle": "(ก)",
                                                "content": "เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า"
                                            },
                                            {
                                                "partTitle": "(ข)",
                                                "content": "ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ"
                                            },
                                            {
                                                "partTitle": "(ค)",
                                                "content": "สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ"
                                            }
                                        ]
                                    },
                                    {
                                        "partTitle": "(15)",
                                        "content": "“หนังสือเดินทาง” หมายความว่า เอกสารสำคัญประจำตัวไม่ว่าจะมีรูปลักษณะใดที่รัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศออกให้แก่บุคคลใด เพื่อใช้แสดงตนในการเดินทางระหว่างประเทศ และให้หมายความรวมถึงเอกสารใช้แทนหนังสือเดินทางและแบบหนังสือเดินทางที่ยังไม่ได้กรอกข้อความเกี่ยวกับผู้ถือหนังสือเดินทางด้วย"
                                    },
                                    {
                                        "partTitle": "(16)",
                                        "content": "“เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่"
                                    },
                                    {
                                        "partTitle": "(17)",
                                        "content": "“สื่อลามกอนาจารเด็ก” หมายความว่า วัตถุหรือสิ่งที่แสดงให้รู้หรือเห็นถึงการกระทำทางเพศของเด็กหรือกับเด็กซึ่งมีอายุไม่เกินสิบแปดปี โดยรูป เรื่อง หรือลักษณะสามารถสื่อไปในทางลามกอนาจาร ไม่ว่าจะอยู่ในรูปแบบของเอกสาร ภาพเขียน ภาพพิมพ์ ภาพระบายสี สิ่งพิมพ์ รูปภาพ ภาพโฆษณา เครื่องหมาย รูปถ่าย ภาพยนตร์ แถบบันทึกเสียง แถบบันทึกภาพ หรือรูปแบบอื่นใดในลักษณะทำนองเดียวกัน และให้หมายความรวมถึงวัตถุหรือสิ่งต่าง ๆ ข้างต้นที่จัดเก็บในระบบคอมพิวเตอร์หรือในอุปกรณ์อิเล็กทรอนิกส์อื่นที่สามารถแสดงผลให้เข้าใจความหมายได้"
                                    },
                                    {
                                        "partTitle": "(18)",
                                        "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 2 การใช้กฏหมายอาญา",
                "subsections": [
                    {
                        "subsectionTitle":"มาตรา 2",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 2",
                                "description": "บุคคลจักต้องรับโทษในทางอาญาต่อเมื่อได้กระทำการอันกฎหมายที่ใช้ในขณะกระทำนั้นบัญญัติเป็นความผิดและกำหนดโทษไว้ และโทษที่จะลงแก่ผู้กระทำความผิดนั้น ต้องเป็นโทษที่บัญญัติไว้ในกฎหมาย",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 1",
                                        "content": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง การกระทำเช่นนั้นไม่เป็นความผิดต่อไป ให้ผู้ที่ได้กระทำการนั้นพ้นจากการเป็นผู้กระทำความผิด และถ้าได้มีคำพิพากษาถึงที่สุดให้ลงโทษแล้ว ก็ให้ถือว่าผู้นั้นไม่เคยต้องคำพิพากษาว่าได้กระทำความผิดนั้น ถ้ารับโทษอยู่ก็ให้การลงโทษนั้นสิ้นสุดลง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 3",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 3",
                                "description": "ถ้ากฎหมายที่ใช้ในขณะกระทำความผิดแตกต่างกับกฎหมายที่ใช้ในภายหลังการกระทำความผิด ให้ใช้กฎหมายในส่วนที่เป็นคุณแก่ผู้กระทำความผิด ไม่ว่าในทางใด เว้นแต่คดีถึงที่สุดแล้ว แต่ในกรณีที่คดีถึงที่สุดแล้ว ดังต่อไปนี้",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ถ้าผู้กระทำความผิดยังไม่ได้รับโทษ หรือกำลังรับโทษอยู่ และโทษที่กำหนดตามคำพิพากษาหนักกว่าโทษที่กำหนดตามกฎหมายที่บัญญัติในภายหลัง เมื่อสำนวนความปรากฏแก่ศาลหรือเมื่อผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ ให้ศาลกำหนดโทษเสียใหม่ตามกฎหมายที่บัญญัติในภายหลัง ในการที่ศาลจะกำหนดโทษใหม่นี้ ถ้าปรากฏว่า ผู้กระทำความผิดได้รับโทษมาบ้างแล้ว เมื่อได้คำนึงถึงโทษตามกฎหมายที่บัญญัติในภายหลัง หากเห็นเป็นการสมควร ศาลจะกำหนดโทษน้อยกว่าโทษขั้นต่ำที่กฎหมายที่บัญญัติในภายหลังกำหนดไว้ถ้าหากมีก็ได้ หรือถ้าเห็นว่าโทษที่ผู้กระทำความผิดได้รับมาแล้วเป็นการเพียงพอ ศาลจะปล่อยผู้กระทำความผิดไปก็ได้"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ถ้าศาลพิพากษาให้ประหารชีวิตผู้กระทำความผิด และตามกฎหมายที่บัญญัติในภายหลัง โทษที่จะลงแก่ผู้กระทำความผิดไม่ถึงประหารชีวิต ให้งดการประหารชีวิตผู้กระทำความผิด และให้ถือว่าโทษประหารชีวิตตามคำพิพากษาได้เปลี่ยนเป็นโทษสูงสุดที่จะพึงลงได้ตามกฎหมายที่บัญญัติในภายหลัง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 4",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 4",
                                "description": "ผู้ใดกระทำความผิดในราชอาณาจักร ต้องรับโทษตามกฎหมาย",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "การกระทำความผิดในเรือไทยหรืออากาศยานไทย ไม่ว่าจะอยู่ ณ ที่ใด ให้ถือว่ากระทำความผิดในราชอาณาจักร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 5",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 5",
                                "description": "ความผิดใดที่การกระทำแม้แต่ส่วนหนึ่งส่วนใดได้กระทำในราชอาณาจักรก็ดี ผลแห่งการกระทำเกิดในราชอาณาจักรโดยผู้กระทำประสงค์ให้ผลนั้นเกิดในราชอาณาจักร หรือโดยลักษณะแห่งการกระทำ ผลที่เกิดขึ้นนั้นควรเกิดในราชอาณาจักรหรือย่อมจะเล็งเห็นได้ว่าผลนั้นจะเกิดในราชอาณาจักรก็ดี ให้ถือว่าความผิดนั้นได้กระทำในราชอาณาจักร",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ในกรณีการตระเตรียมการ หรือพยายามกระทำการใดซึ่งกฎหมายบัญญัติเป็นความผิด แม้การกระทำนั้นจะได้กระทำนอกราชอาณาจักร ถ้าหากการกระทำนั้นจะได้กระทำตลอดไปจนถึงขั้นความผิดสำเร็จ ผลจะเกิดขึ้นในราชอาณาจักร ให้ถือว่า การตระเตรียมการหรือพยายามกระทำความผิดนั้นได้กระทำในราชอาณาจักร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 6",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 6",
                                "description": "ความผิดใดที่ได้กระทำในราชอาณาจักรหรือที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร แม้การกระทำของผู้เป็นตัวการด้วยกัน ของผู้สนับสนุน หรือของผู้ใช้ให้กระทำความผิดนั้นจะได้กระทำนอกราชอาณาจักร ก็ให้ถือว่าตัวการ ผู้สนับสนุน หรือผู้ใช้ให้กระทำได้กระทำในราชอาณาจักร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 7",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 7",
                                "description": "ผู้ใดกระทำความผิดดังระบุไว้ต่อไปนี้นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร คือ",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๒๙"
                                    },
                                    {
                                        "partTitle": "(1/1)",
                                        "content": "ความผิดเกี่ยวกับการก่อการร้ายตามที่บัญญัติไว้ในมาตรา ๑๓๕/๑ มาตรา ๑๓๕/๒ มาตรา ๑๓๕/๓ และมาตรา ๑๓๕/๔"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ความผิดเกี่ยวกับการปลอมและการแปลง ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ และมาตรา ๒๖๖ (๓) และ (๔)"
                                    },
                                    {
                                        "partTitle": "(2 ทวิ)",
                                        "content": "ความผิดเกี่ยวกับเพศตามที่บัญญัติไว้ในมาตรา ๒๘๒ และมาตรา ๒๘๓"
                                    },
                                    {
                                        "partTitle": "(3)",
                                        "content": "ความผิดฐานชิงทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๙ และความผิดฐานปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๔๐ ซึ่งได้กระทำในทะเลหลวง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 8",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 8",
                                "description": "ผู้ใดกระทำความผิดนอกราชอาณาจักร และ",
                                "splitSections": [
                                    {
                                        "partTitle": "(ก)",
                                        "content": "ผู้กระทำความผิดนั้นเป็นคนไทย และรัฐบาลแห่งประเทศที่ความผิดได้เกิดขึ้น หรือผู้เสียหายได้ร้องขอให้ลงโทษ หรือ"
                                    },
                                    {
                                        "partTitle": "(ข)",
                                        "content": "ผู้กระทำความผิดนั้นเป็นคนต่างด้าว และรัฐบาลไทยหรือคนไทยเป็นผู้เสียหาย และผู้เสียหายได้ร้องขอให้ลงโทษ"
                                    },
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ถ้าความผิดนั้นเป็นความผิดดังระบุไว้ต่อไปนี้ จะต้องรับโทษภายในราชอาณาจักร คือ",
                                        "splitSections": [
                                            {
                                                "partTitle": "(1)",
                                                "content": "ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๑ ถึงมาตรา ๒๒๓  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๒๐ วรรคแรก และมาตรา ๒๒๔ มาตรา ๒๒๖ มาตรา ๒๒๘ ถึงมาตรา ๒๓๒ มาตรา ๒๓๗ และมาตรา ๒๓๓ ถึงมาตรา ๒๓๖  ทั้งนี้ เฉพาะเมื่อเป็นกรณีต้องระวางโทษตามมาตรา ๒๓๘"
                                            },
                                            {
                                                "partTitle": "(2)",
                                                "content": "ความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ (๑) และ (๒) มาตรา ๒๖๘  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๖๗ และมาตรา ๒๖๙"
                                            },
                                            {
                                                "partTitle": "(2/1)",
                                                "content": "ความผิดเกี่ยวกับบัตรอิเล็กทรอนิกส์ตามที่บัญญัติไว้ในมาตรา ๒๖๙/๑ ถึงมาตรา ๒๖๙/๗"
                                            },
                                            {
                                                "partTitle": "(2/2)",
                                                "content": "ความผิดเกี่ยวกับหนังสือเดินทางตามที่บัญญัติไว้ในมาตรา ๒๖๙/๘ ถึงมาตรา ๒๖๙/๑๕"
                                            },
                                            {
                                                "partTitle": "(3)",
                                                "content": "ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ มาตรา ๒๘๐ และมาตรา ๒๘๕  ทั้งนี้ เฉพาะที่เกี่ยวกับมาตรา ๒๗๖"
                                            },
                                            {
                                                "partTitle": "(4)",
                                                "content": "ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐"
                                            },
                                            {
                                                "partTitle": "(5)",
                                                "content": "ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๘"
                                            },
                                            {
                                                "partTitle": "(6)",
                                                "content": "ความผิดฐานทอดทิ้งเด็ก คนป่วยเจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘"
                                            },
                                            {
                                                "partTitle": "(7)",
                                                "content": "ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ มาตรา ๓๑๒ ถึงมาตรา ๓๑๕ และมาตรา ๓๑๗ ถึงมาตรา ๓๒๐"
                                            },
                                            {
                                                "partTitle": "(8)",
                                                "content": "ความผิดฐานลักทรัพย์และวิ่งราวทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖"
                                            },
                                            {
                                                "partTitle": "(9)",
                                                "content": "ความผิดฐานกรรโชก รีดเอาทรัพย์ ชิงทรัพย์ และปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๗ ถึงมาตรา ๓๔๐"
                                            },
                                            {
                                                "partTitle": "(10)",
                                                "content": "ความผิดฐานฉ้อโกง ตามที่บัญญัติไว้ในมาตรา ๓๔๑ ถึงมาตรา ๓๔๔ มาตรา ๓๔๖ และมาตรา ๓๔๗"
                                            },
                                            {
                                                "partTitle": "(11)",
                                                "content": "ความผิดฐานยักยอก ตามที่บัญญัติไว้ในมาตรา ๓๕๒ ถึงมาตรา ๓๕๔"
                                            },
                                            {
                                                "partTitle": "(12)",
                                                "content": "ความผิดฐานรับของโจร ตามที่บัญญัติไว้ในมาตรา ๓๕๗"
                                            },
                                            {
                                                "partTitle": "(13)",
                                                "content": "ความผิดฐานทำให้เสียทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๕๘ ถึงมาตรา ๓๖๐"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 9",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 9",
                                "description": "เจ้าพนักงานของรัฐบาลไทยกระทำความผิดตามที่บัญญัติไว้ในมาตรา ๑๔๗ ถึงมาตรา ๑๖๖ และมาตรา ๒๐๐ ถึงมาตรา ๒๐๕ นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 10",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 10",
                                "description": "ผู้ใดกระทำการนอกราชอาณาจักรซึ่งเป็นความผิดตามมาตราต่าง ๆ ที่ระบุไว้ในมาตรา ๗ (๒) และ (๓) มาตรา ๘ และมาตรา ๙ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ศาลในต่างประเทศพิพากษาให้ลงโทษ และผู้นั้นได้พ้นโทษแล้ว"
                                    },
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ถ้าผู้ต้องคำพิพากษาได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้ว แต่ยังไม่พ้นโทษ ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้  ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 11",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 11",
                                "description": "ผู้ใดกระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร ถ้าผู้นั้นได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้วทั้งหมด หรือแต่บางส่วน ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้  ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ในกรณีที่ผู้กระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร ได้ถูกฟ้องต่อศาลในต่างประเทศโดยรัฐบาลไทยร้องขอ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า",
                                        "splitSections": [
                                            {
                                                "partTitle": "(1)",
                                                "content": "ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ"
                                            },
                                            {
                                                "partTitle": "(2)",
                                                "content": "ศาลในต่างประเทศพิพากษาให้ลงโทษ และผู้นั้นได้พ้นโทษแล้ว"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 12",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 12",
                                "description": "วิธีการเพื่อความปลอดภัยจะใช้บังคับแก่บุคคลใดได้ก็ต่อเมื่อมีบทบัญญัติแห่งกฎหมายให้ใช้บังคับได้เท่านั้น และกฎหมายที่จะใช้บังคับนั้นให้ใช้กฎหมายในขณะที่ศาลพิพากษา"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 13",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 13",
                                "description": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังได้มีการยกเลิกวิธีการเพื่อความปลอดภัยใด และถ้าผู้ใดถูกใช้บังคับวิธีการเพื่อความปลอดภัยนั้นอยู่ ก็ให้ศาลสั่งระงับการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นเสีย เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 14",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 14",
                                "description": "ในกรณีที่มีผู้ถูกใช้บังคับวิธีการเพื่อความปลอดภัยใดอยู่ และได้มีบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเปลี่ยนแปลงเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นไป ซึ่งเป็นผลอันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้นได้ หรือนำมาใช้บังคับได้แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 15",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 15",
                                "description": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง โทษใดได้เปลี่ยนลักษณะมาเป็นวิธีการเพื่อความปลอดภัย และได้มีคำพิพากษาลงโทษนั้นแก่บุคคลใดไว้ ก็ให้ถือว่าโทษที่ลงนั้นเป็นวิธีการเพื่อความปลอดภัยด้วย",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ในกรณีดังกล่าวในวรรคแรก ถ้ายังไม่ได้ลงโทษผู้นั้น หรือผู้นั้นยังรับโทษอยู่ ก็ให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นต่อไป และถ้าหากว่าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังมีเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัย อันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้น หรือนำมาใช้บังคับได้ แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 16",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 16",
                                "description": "เมื่อศาลได้พิพากษาให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้ใดแล้ว ถ้าภายหลังความปรากฏแก่ศาลตามคำเสนอของผู้นั้นเอง ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการว่า พฤติการณ์เกี่ยวกับการใช้บังคับนั้นได้เปลี่ยนแปลงไปจากเดิม ศาลจะสั่งเพิกถอนหรืองดการใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นไว้ชั่วคราวตามที่เห็นสมควรก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 17",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 17",
                                "description": "บทบัญญัติในภาค ๑ แห่งประมวลกฎหมายนี้ ให้ใช้ในกรณีแห่งความผิดตามกฎหมายอื่นด้วย เว้นแต่กฎหมายนั้น ๆ จะได้บัญญัติไว้เป็นอย่างอื่น"
                            }
                        ]
                    }

                ]
            },
            {
                "sectionTitle":"หมวด 3 โทษและวิธีการเพื่อความปลอดภัย",
                "subSections": [
                    {
                        "subsectionTitle":"ส่วนที่ 1 โทษ",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 18",
                                "description": "โทษสำหรับลงแก่ผู้กระทำความผิดมีดังนี้",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content": "ประหารชีวิต"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content": "จำคุก"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content": "กักขัง"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content": "ปรับ"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content": "ริบทรัพย์สิน"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "โทษประหารชีวิตและโทษจำคุกตลอดชีวิตมิให้นำมาใช้บังคับแก่ผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปี"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "ในกรณีผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปีได้กระทำความผิดที่มีระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต ให้ถือว่าระวางโทษดังกล่าวได้เปลี่ยนเป็นระวางโทษจำคุกห้าสิบปี๒"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 19",
                                "description": "ผู้ใดต้องโทษประหารชีวิต ให้ดำเนินการด้วยวิธีฉีดยาหรือสารพิษให้ตาย",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "หลักเกณฑ์และวิธีการประหารชีวิต ให้เป็นไปตามระเบียบที่กระทรวงยุติธรรมกำหนด โดยประกาศในราชกิจจานุเบกษา"
                                    }
                                ]
                                
                            },
                            {
                                "articleNumber":"มาตรา 20",
                                "description": "บรรดาความผิดที่กฎหมายกำหนดให้ลงโทษทั้งจำคุกและปรับด้วยนั้น ถ้าศาลเห็นสมควรจะลงแต่โทษจำคุกก็ได้"
                                
                            },
                            {
                                "articleNumber":"มาตรา 21",
                                "description": "ในการคำนวณระยะเวลาจำคุก ให้นับวันเริ่มจำคุกรวมคำนวณเข้าด้วย และให้นับเป็นหนึ่งวันเต็มโดยไม่ต้องคำนึงถึงจำนวนชั่วโมง",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ถ้าระยะเวลาที่คำนวณนั้นกำหนดเป็นเดือน ให้นับสามสิบวันเป็นหนึ่งเดือน ถ้ากำหนดเป็นปี ให้คำนวณตามปีปฏิทินในราชการ"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"เมื่อผู้ต้องคำพิพากษาถูกจำคุกครบกำหนดแล้ว ให้ปล่อยตัวในวันถัดจากวันที่ครบกำหนด"
                                    },
                                ]
                                
                            }
                        ]
                    }
                ]

            }
            
        ]
    }
}