{
    {
        "lawType": "crime",
        "part": "ภาค 1 บทบัญญัติทั่วไป",
        "category": "ลักษณะ 1 บทบัญญัติที่ใช้แก่ความผิดทั่วไป",
        "sections": [
            {
                "sectionTitle": "หมวด 1 บทนิยาม",
                "subsections": [
                    {
                        "subsectionTitle": "มาตรา 1",
                        "articles": [
                            {
                                "articleNumber": "มาตรา 1",
                                "description": "ในประมวลกฎหมายนี้",
                                "splitSections":[
                                    {
                                        "partTitle": "(1)",
                                        "content": "“โดยทุจริต” หมายความว่า เพื่อแสวงหาประโยชน์ที่มิควรได้โดยชอบด้วยกฎหมายสำหรับตนเองหรือผู้อื่น"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "“ทางสาธารณะ” หมายความว่า ทางบกหรือทางน้ำสำหรับประชาชนใช้ในการจราจร และให้หมายความรวมถึงทางรถไฟและทางรถรางที่มีรถเดิน สำหรับประชาชนโดยสารด้วย"
                                    },
                                    {
                                        "partTitle": "(3)",
                                        "content": "“สาธารณสถาน” หมายความว่า สถานที่ใด ๆ ซึ่งประชาชนมีความชอบธรรมที่จะเข้าไปได้"
                                    },
                                    {
                                        "partTitle": "(4)",
                                        "content": "“เคหสถาน” หมายความว่า ที่ซึ่งใช้เป็นที่อยู่อาศัย เช่น เรือน โรง เรือ หรือแพ ซึ่งคนอยู่อาศัย และให้หมายความรวมถึงบริเวณของที่ซึ่งใช้เป็นที่อยู่อาศัยนั้นด้วย จะมีรั้วล้อมหรือไม่ก็ตาม"
                                    },
                                    {
                                        "partTitle": "(5)",
                                        "content": "“อาวุธ” หมายความรวมถึงสิ่งซึ่งไม่เป็นอาวุธโดยสภาพ แต่ซึ่งได้ใช้หรือเจตนาจะใช้ประทุษร้ายร่างกายถึงอันตรายสาหัสอย่างอาวุธ"
                                    },
                                    {
                                        "partTitle": "(6)",
                                        "content": "“ใช้กำลังประทุษร้าย” หมายความว่า ทำการประทุษร้ายแก่กายหรือจิตใจของบุคคล ไม่ว่าจะทำด้วยใช้แรงกายภาพหรือด้วยวิธีอื่นใด และให้หมายความรวมถึงการกระทำใด ๆ ซึ่งเป็นเหตุให้บุคคลหนึ่งบุคคลใดอยู่ในภาวะที่ไม่สามารถขัดขืนได้ ไม่ว่าจะโดยใช้ยาทำให้มึนเมา สะกดจิต หรือใช้วิธีอื่นใดอันคล้ายคลึงกัน"
                                    },
                                    {
                                        "partTitle": "(7)",
                                        "content": "“เอกสาร” หมายความว่า กระดาษหรือวัตถุอื่นใดซึ่งได้ทำให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข ผัง หรือแผนแบบอย่างอื่น จะเป็นโดยวิธีพิมพ์ ถ่ายภาพ หรือวิธีอื่นอันเป็นหลักฐานแห่งความหมายนั้น"
                                    },
                                    {
                                        "partTitle": "(8)",
                                        "content": "“เอกสารราชการ” หมายความว่า เอกสารซึ่งเจ้าพนักงานได้ทำขึ้นหรือรับรองในหน้าที่ และให้หมายความรวมถึงสำเนาเอกสารนั้น ๆ ที่เจ้าพนักงานได้รับรองในหน้าที่ด้วย"
                                    },
                                    {
                                        "partTitle": "(9)",
                                        "content": "“เอกสารสิทธิ” หมายความว่า เอกสารที่เป็นหลักฐานแห่งการก่อ เปลี่ยนแปลง โอน สงวนหรือระงับซึ่งสิทธิ"
                                    },
                                    {
                                        "partTitle": "(10)",
                                        "content": "“ลายมือชื่อ” หมายความรวมถึงลายพิมพ์นิ้วมือและเครื่องหมายซึ่งบุคคลลงไว้แทนลายมือชื่อของตน"
                                    },
                                    {
                                        "partTitle": "(11)",
                                        "content": "“กลางคืน” หมายความว่า เวลาระหว่างพระอาทิตย์ตกและพระอาทิตย์ขึ้น"
                                    },
                                    {
                                        "partTitle": "(12)",
                                        "content": "“คุมขัง” หมายความว่า คุมตัว ควบคุม ขัง กักขังหรือจำคุก"
                                    },
                                    {
                                        "partTitle": "(13)",
                                        "content": "“ค่าไถ่” หมายความว่า ทรัพย์สินหรือประโยชน์ที่เรียกเอา หรือให้เพื่อแลกเปลี่ยนเสรีภาพของผู้ถูกเอาตัวไป ผู้ถูกหน่วงเหนี่ยวหรือผู้ถูกกักขัง"
                                    },
                                    {
                                        "partTitle": "(14)",
                                        "content": "“บัตรอิเล็กทรอนิกส์” หมายความว่า",
                                        "splitSection": [
                                            {
                                                "partTitle": "(ก)",
                                                "content": "เอกสารหรือวัตถุอื่นใดไม่ว่าจะมีรูปลักษณะใดที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ ซึ่งจะระบุชื่อหรือไม่ก็ตาม โดยบันทึกข้อมูลหรือรหัสไว้ด้วยการประยุกต์ใช้วิธีการทางอิเล็กตรอน ไฟฟ้า คลื่นแม่เหล็กไฟฟ้า หรือวิธีอื่นใดในลักษณะคล้ายกัน ซึ่งรวมถึงการประยุกต์ใช้วิธีการทางแสงหรือวิธีการทางแม่เหล็กให้ปรากฏความหมายด้วยตัวอักษร ตัวเลข รหัส หมายเลขบัตร หรือสัญลักษณ์อื่นใด ทั้งที่สามารถมองเห็นและมองไม่เห็นด้วยตาเปล่า"
                                            },
                                            {
                                                "partTitle": "(ข)",
                                                "content": "ข้อมูล รหัส หมายเลขบัญชี หมายเลขชุดทางอิเล็กทรอนิกส์หรือเครื่องมือทางตัวเลขใด ๆ ที่ผู้ออกได้ออกให้แก่ผู้มีสิทธิใช้ โดยมิได้มีการออกเอกสารหรือวัตถุอื่นใดให้ แต่มีวิธีการใช้ในทำนองเดียวกับ (ก) หรือ"
                                            },
                                            {
                                                "partTitle": "(ค)",
                                                "content": "สิ่งอื่นใดที่ใช้ประกอบกับข้อมูลอิเล็กทรอนิกส์เพื่อแสดงความสัมพันธ์ระหว่างบุคคลกับข้อมูลอิเล็กทรอนิกส์ โดยมีวัตถุประสงค์เพื่อระบุตัวบุคคลผู้เป็นเจ้าของ"
                                            }
                                        ]
                                    },
                                    {
                                        "partTitle": "(15)",
                                        "content": "“หนังสือเดินทาง” หมายความว่า เอกสารสำคัญประจำตัวไม่ว่าจะมีรูปลักษณะใดที่รัฐบาลไทย รัฐบาลต่างประเทศ หรือองค์การระหว่างประเทศออกให้แก่บุคคลใด เพื่อใช้แสดงตนในการเดินทางระหว่างประเทศ และให้หมายความรวมถึงเอกสารใช้แทนหนังสือเดินทางและแบบหนังสือเดินทางที่ยังไม่ได้กรอกข้อความเกี่ยวกับผู้ถือหนังสือเดินทางด้วย"
                                    },
                                    {
                                        "partTitle": "(16)",
                                        "content": "“เจ้าพนักงาน” หมายความว่า บุคคลซึ่งกฎหมายบัญญัติว่าเป็นเจ้าพนักงานหรือได้รับแต่งตั้งตามกฎหมายให้ปฏิบัติหน้าที่ราชการ ไม่ว่าเป็นประจำหรือครั้งคราว และไม่ว่าจะได้รับค่าตอบแทนหรือไม่"
                                    },
                                    {
                                        "partTitle": "(17)",
                                        "content": "“สื่อลามกอนาจารเด็ก” หมายความว่า วัตถุหรือสิ่งที่แสดงให้รู้หรือเห็นถึงการกระทำทางเพศของเด็กหรือกับเด็กซึ่งมีอายุไม่เกินสิบแปดปี โดยรูป เรื่อง หรือลักษณะสามารถสื่อไปในทางลามกอนาจาร ไม่ว่าจะอยู่ในรูปแบบของเอกสาร ภาพเขียน ภาพพิมพ์ ภาพระบายสี สิ่งพิมพ์ รูปภาพ ภาพโฆษณา เครื่องหมาย รูปถ่าย ภาพยนตร์ แถบบันทึกเสียง แถบบันทึกภาพ หรือรูปแบบอื่นใดในลักษณะทำนองเดียวกัน และให้หมายความรวมถึงวัตถุหรือสิ่งต่าง ๆ ข้างต้นที่จัดเก็บในระบบคอมพิวเตอร์หรือในอุปกรณ์อิเล็กทรอนิกส์อื่นที่สามารถแสดงผลให้เข้าใจความหมายได้"
                                    },
                                    {
                                        "partTitle": "(18)",
                                        "content": "“กระทำชำเรา” หมายความว่า กระทำเพื่อสนองความใคร่ของผู้กระทำ โดยการใช้อวัยวะเพศของผู้กระทำล่วงล้ำอวัยวะเพศ ทวารหนัก หรือช่องปากของผู้อื่น"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 2 การใช้กฏหมายอาญา",
                "subsections": [
                    {
                        "subsectionTitle":"มาตรา 2",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 2",
                                "description": "บุคคลจักต้องรับโทษในทางอาญาต่อเมื่อได้กระทำการอันกฎหมายที่ใช้ในขณะกระทำนั้นบัญญัติเป็นความผิดและกำหนดโทษไว้ และโทษที่จะลงแก่ผู้กระทำความผิดนั้น ต้องเป็นโทษที่บัญญัติไว้ในกฎหมาย",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 1",
                                        "content": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง การกระทำเช่นนั้นไม่เป็นความผิดต่อไป ให้ผู้ที่ได้กระทำการนั้นพ้นจากการเป็นผู้กระทำความผิด และถ้าได้มีคำพิพากษาถึงที่สุดให้ลงโทษแล้ว ก็ให้ถือว่าผู้นั้นไม่เคยต้องคำพิพากษาว่าได้กระทำความผิดนั้น ถ้ารับโทษอยู่ก็ให้การลงโทษนั้นสิ้นสุดลง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 3",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 3",
                                "description": "ถ้ากฎหมายที่ใช้ในขณะกระทำความผิดแตกต่างกับกฎหมายที่ใช้ในภายหลังการกระทำความผิด ให้ใช้กฎหมายในส่วนที่เป็นคุณแก่ผู้กระทำความผิด ไม่ว่าในทางใด เว้นแต่คดีถึงที่สุดแล้ว แต่ในกรณีที่คดีถึงที่สุดแล้ว ดังต่อไปนี้",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ถ้าผู้กระทำความผิดยังไม่ได้รับโทษ หรือกำลังรับโทษอยู่ และโทษที่กำหนดตามคำพิพากษาหนักกว่าโทษที่กำหนดตามกฎหมายที่บัญญัติในภายหลัง เมื่อสำนวนความปรากฏแก่ศาลหรือเมื่อผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ ให้ศาลกำหนดโทษเสียใหม่ตามกฎหมายที่บัญญัติในภายหลัง ในการที่ศาลจะกำหนดโทษใหม่นี้ ถ้าปรากฏว่า ผู้กระทำความผิดได้รับโทษมาบ้างแล้ว เมื่อได้คำนึงถึงโทษตามกฎหมายที่บัญญัติในภายหลัง หากเห็นเป็นการสมควร ศาลจะกำหนดโทษน้อยกว่าโทษขั้นต่ำที่กฎหมายที่บัญญัติในภายหลังกำหนดไว้ถ้าหากมีก็ได้ หรือถ้าเห็นว่าโทษที่ผู้กระทำความผิดได้รับมาแล้วเป็นการเพียงพอ ศาลจะปล่อยผู้กระทำความผิดไปก็ได้"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ถ้าศาลพิพากษาให้ประหารชีวิตผู้กระทำความผิด และตามกฎหมายที่บัญญัติในภายหลัง โทษที่จะลงแก่ผู้กระทำความผิดไม่ถึงประหารชีวิต ให้งดการประหารชีวิตผู้กระทำความผิด และให้ถือว่าโทษประหารชีวิตตามคำพิพากษาได้เปลี่ยนเป็นโทษสูงสุดที่จะพึงลงได้ตามกฎหมายที่บัญญัติในภายหลัง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 4",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 4",
                                "description": "ผู้ใดกระทำความผิดในราชอาณาจักร ต้องรับโทษตามกฎหมาย",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "การกระทำความผิดในเรือไทยหรืออากาศยานไทย ไม่ว่าจะอยู่ ณ ที่ใด ให้ถือว่ากระทำความผิดในราชอาณาจักร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 5",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 5",
                                "description": "ความผิดใดที่การกระทำแม้แต่ส่วนหนึ่งส่วนใดได้กระทำในราชอาณาจักรก็ดี ผลแห่งการกระทำเกิดในราชอาณาจักรโดยผู้กระทำประสงค์ให้ผลนั้นเกิดในราชอาณาจักร หรือโดยลักษณะแห่งการกระทำ ผลที่เกิดขึ้นนั้นควรเกิดในราชอาณาจักรหรือย่อมจะเล็งเห็นได้ว่าผลนั้นจะเกิดในราชอาณาจักรก็ดี ให้ถือว่าความผิดนั้นได้กระทำในราชอาณาจักร",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ในกรณีการตระเตรียมการ หรือพยายามกระทำการใดซึ่งกฎหมายบัญญัติเป็นความผิด แม้การกระทำนั้นจะได้กระทำนอกราชอาณาจักร ถ้าหากการกระทำนั้นจะได้กระทำตลอดไปจนถึงขั้นความผิดสำเร็จ ผลจะเกิดขึ้นในราชอาณาจักร ให้ถือว่า การตระเตรียมการหรือพยายามกระทำความผิดนั้นได้กระทำในราชอาณาจักร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 6",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 6",
                                "description": "ความผิดใดที่ได้กระทำในราชอาณาจักรหรือที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร แม้การกระทำของผู้เป็นตัวการด้วยกัน ของผู้สนับสนุน หรือของผู้ใช้ให้กระทำความผิดนั้นจะได้กระทำนอกราชอาณาจักร ก็ให้ถือว่าตัวการ ผู้สนับสนุน หรือผู้ใช้ให้กระทำได้กระทำในราชอาณาจักร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 7",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 7",
                                "description": "ผู้ใดกระทำความผิดดังระบุไว้ต่อไปนี้นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร คือ",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๒๙"
                                    },
                                    {
                                        "partTitle": "(1/1)",
                                        "content": "ความผิดเกี่ยวกับการก่อการร้ายตามที่บัญญัติไว้ในมาตรา ๑๓๕/๑ มาตรา ๑๓๕/๒ มาตรา ๑๓๕/๓ และมาตรา ๑๓๕/๔"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ความผิดเกี่ยวกับการปลอมและการแปลง ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ มาตรา ๒๕๔ มาตรา ๒๕๖ มาตรา ๒๕๗ และมาตรา ๒๖๖ (๓) และ (๔)"
                                    },
                                    {
                                        "partTitle": "(2 ทวิ)",
                                        "content": "ความผิดเกี่ยวกับเพศตามที่บัญญัติไว้ในมาตรา ๒๘๒ และมาตรา ๒๘๓"
                                    },
                                    {
                                        "partTitle": "(3)",
                                        "content": "ความผิดฐานชิงทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๙ และความผิดฐานปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๔๐ ซึ่งได้กระทำในทะเลหลวง"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 8",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 8",
                                "description": "ผู้ใดกระทำความผิดนอกราชอาณาจักร และ",
                                "splitSections": [
                                    {
                                        "partTitle": "(ก)",
                                        "content": "ผู้กระทำความผิดนั้นเป็นคนไทย และรัฐบาลแห่งประเทศที่ความผิดได้เกิดขึ้น หรือผู้เสียหายได้ร้องขอให้ลงโทษ หรือ"
                                    },
                                    {
                                        "partTitle": "(ข)",
                                        "content": "ผู้กระทำความผิดนั้นเป็นคนต่างด้าว และรัฐบาลไทยหรือคนไทยเป็นผู้เสียหาย และผู้เสียหายได้ร้องขอให้ลงโทษ"
                                    },
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ถ้าความผิดนั้นเป็นความผิดดังระบุไว้ต่อไปนี้ จะต้องรับโทษภายในราชอาณาจักร คือ",
                                        "splitSections": [
                                            {
                                                "partTitle": "(1)",
                                                "content": "ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ มาตรา ๒๑๘ มาตรา ๒๒๑ ถึงมาตรา ๒๒๓  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๒๐ วรรคแรก และมาตรา ๒๒๔ มาตรา ๒๒๖ มาตรา ๒๒๘ ถึงมาตรา ๒๓๒ มาตรา ๒๓๗ และมาตรา ๒๓๓ ถึงมาตรา ๒๓๖  ทั้งนี้ เฉพาะเมื่อเป็นกรณีต้องระวางโทษตามมาตรา ๒๓๘"
                                            },
                                            {
                                                "partTitle": "(2)",
                                                "content": "ความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ มาตรา ๒๖๕ มาตรา ๒๖๖ (๑) และ (๒) มาตรา ๒๖๘  ทั้งนี้ เว้นแต่กรณีเกี่ยวกับมาตรา ๒๖๗ และมาตรา ๒๖๙"
                                            },
                                            {
                                                "partTitle": "(2/1)",
                                                "content": "ความผิดเกี่ยวกับบัตรอิเล็กทรอนิกส์ตามที่บัญญัติไว้ในมาตรา ๒๖๙/๑ ถึงมาตรา ๒๖๙/๗"
                                            },
                                            {
                                                "partTitle": "(2/2)",
                                                "content": "ความผิดเกี่ยวกับหนังสือเดินทางตามที่บัญญัติไว้ในมาตรา ๒๖๙/๘ ถึงมาตรา ๒๖๙/๑๕"
                                            },
                                            {
                                                "partTitle": "(3)",
                                                "content": "ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ มาตรา ๒๘๐ และมาตรา ๒๘๕  ทั้งนี้ เฉพาะที่เกี่ยวกับมาตรา ๒๗๖"
                                            },
                                            {
                                                "partTitle": "(4)",
                                                "content": "ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐"
                                            },
                                            {
                                                "partTitle": "(5)",
                                                "content": "ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๘"
                                            },
                                            {
                                                "partTitle": "(6)",
                                                "content": "ความผิดฐานทอดทิ้งเด็ก คนป่วยเจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘"
                                            },
                                            {
                                                "partTitle": "(7)",
                                                "content": "ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ มาตรา ๓๑๒ ถึงมาตรา ๓๑๕ และมาตรา ๓๑๗ ถึงมาตรา ๓๒๐"
                                            },
                                            {
                                                "partTitle": "(8)",
                                                "content": "ความผิดฐานลักทรัพย์และวิ่งราวทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖"
                                            },
                                            {
                                                "partTitle": "(9)",
                                                "content": "ความผิดฐานกรรโชก รีดเอาทรัพย์ ชิงทรัพย์ และปล้นทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๗ ถึงมาตรา ๓๔๐"
                                            },
                                            {
                                                "partTitle": "(10)",
                                                "content": "ความผิดฐานฉ้อโกง ตามที่บัญญัติไว้ในมาตรา ๓๔๑ ถึงมาตรา ๓๔๔ มาตรา ๓๔๖ และมาตรา ๓๔๗"
                                            },
                                            {
                                                "partTitle": "(11)",
                                                "content": "ความผิดฐานยักยอก ตามที่บัญญัติไว้ในมาตรา ๓๕๒ ถึงมาตรา ๓๕๔"
                                            },
                                            {
                                                "partTitle": "(12)",
                                                "content": "ความผิดฐานรับของโจร ตามที่บัญญัติไว้ในมาตรา ๓๕๗"
                                            },
                                            {
                                                "partTitle": "(13)",
                                                "content": "ความผิดฐานทำให้เสียทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๕๘ ถึงมาตรา ๓๖๐"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 9",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 9",
                                "description": "เจ้าพนักงานของรัฐบาลไทยกระทำความผิดตามที่บัญญัติไว้ในมาตรา ๑๔๗ ถึงมาตรา ๑๖๖ และมาตรา ๒๐๐ ถึงมาตรา ๒๐๕ นอกราชอาณาจักร จะต้องรับโทษในราชอาณาจักร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 10",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 10",
                                "description": "ผู้ใดกระทำการนอกราชอาณาจักรซึ่งเป็นความผิดตามมาตราต่าง ๆ ที่ระบุไว้ในมาตรา ๗ (๒) และ (๓) มาตรา ๘ และมาตรา ๙ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า",
                                "splitSections": [
                                    {
                                        "partTitle": "(1)",
                                        "content": "ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ศาลในต่างประเทศพิพากษาให้ลงโทษ และผู้นั้นได้พ้นโทษแล้ว"
                                    },
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ถ้าผู้ต้องคำพิพากษาได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้ว แต่ยังไม่พ้นโทษ ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้  ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 11",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 11",
                                "description": "ผู้ใดกระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร ถ้าผู้นั้นได้รับโทษสำหรับการกระทำนั้นตามคำพิพากษาของศาลในต่างประเทศมาแล้วทั้งหมด หรือแต่บางส่วน ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ หรือจะไม่ลงโทษเลยก็ได้  ทั้งนี้ โดยคำนึงถึงโทษที่ผู้นั้นได้รับมาแล้ว",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ในกรณีที่ผู้กระทำความผิดในราชอาณาจักร หรือกระทำความผิดที่ประมวลกฎหมายนี้ถือว่าได้กระทำในราชอาณาจักร ได้ถูกฟ้องต่อศาลในต่างประเทศโดยรัฐบาลไทยร้องขอ ห้ามมิให้ลงโทษผู้นั้นในราชอาณาจักรเพราะการกระทำนั้นอีก ถ้า",
                                        "splitSections": [
                                            {
                                                "partTitle": "(1)",
                                                "content": "ได้มีคำพิพากษาของศาลในต่างประเทศอันถึงที่สุดให้ปล่อยตัวผู้นั้น หรือ"
                                            },
                                            {
                                                "partTitle": "(2)",
                                                "content": "ศาลในต่างประเทศพิพากษาให้ลงโทษ และผู้นั้นได้พ้นโทษแล้ว"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 12",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 12",
                                "description": "วิธีการเพื่อความปลอดภัยจะใช้บังคับแก่บุคคลใดได้ก็ต่อเมื่อมีบทบัญญัติแห่งกฎหมายให้ใช้บังคับได้เท่านั้น และกฎหมายที่จะใช้บังคับนั้นให้ใช้กฎหมายในขณะที่ศาลพิพากษา"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 13",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 13",
                                "description": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังได้มีการยกเลิกวิธีการเพื่อความปลอดภัยใด และถ้าผู้ใดถูกใช้บังคับวิธีการเพื่อความปลอดภัยนั้นอยู่ ก็ให้ศาลสั่งระงับการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นเสีย เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอ"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 14",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 14",
                                "description": "ในกรณีที่มีผู้ถูกใช้บังคับวิธีการเพื่อความปลอดภัยใดอยู่ และได้มีบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเปลี่ยนแปลงเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัยนั้นไป ซึ่งเป็นผลอันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้นได้ หรือนำมาใช้บังคับได้แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 15",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 15",
                                "description": "ถ้าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลัง โทษใดได้เปลี่ยนลักษณะมาเป็นวิธีการเพื่อความปลอดภัย และได้มีคำพิพากษาลงโทษนั้นแก่บุคคลใดไว้ ก็ให้ถือว่าโทษที่ลงนั้นเป็นวิธีการเพื่อความปลอดภัยด้วย",
                                "splitSections": [
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ในกรณีดังกล่าวในวรรคแรก ถ้ายังไม่ได้ลงโทษผู้นั้น หรือผู้นั้นยังรับโทษอยู่ ก็ให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นต่อไป และถ้าหากว่าตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังมีเงื่อนไขที่จะสั่งให้มีการใช้บังคับวิธีการเพื่อความปลอดภัย อันไม่อาจนำมาใช้บังคับแก่กรณีของผู้นั้น หรือนำมาใช้บังคับได้ แต่การใช้บังคับวิธีการเพื่อความปลอดภัยตามบทบัญญัติของกฎหมายที่บัญญัติในภายหลังเป็นคุณแก่ผู้นั้นยิ่งกว่า เมื่อสำนวนความปรากฏแก่ศาล หรือเมื่อผู้นั้น ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการร้องขอต่อศาลให้ยกเลิกการใช้บังคับวิธีการเพื่อความปลอดภัย หรือร้องขอรับผลตามบทบัญญัติแห่งกฎหมายนั้น แล้วแต่กรณี ให้ศาลมีอำนาจสั่งตามที่เห็นสมควร"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 16",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 16",
                                "description": "เมื่อศาลได้พิพากษาให้ใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้ใดแล้ว ถ้าภายหลังความปรากฏแก่ศาลตามคำเสนอของผู้นั้นเอง ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้นหรือพนักงานอัยการว่า พฤติการณ์เกี่ยวกับการใช้บังคับนั้นได้เปลี่ยนแปลงไปจากเดิม ศาลจะสั่งเพิกถอนหรืองดการใช้บังคับวิธีการเพื่อความปลอดภัยแก่ผู้นั้นไว้ชั่วคราวตามที่เห็นสมควรก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 17",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 17",
                                "description": "บทบัญญัติในภาค ๑ แห่งประมวลกฎหมายนี้ ให้ใช้ในกรณีแห่งความผิดตามกฎหมายอื่นด้วย เว้นแต่กฎหมายนั้น ๆ จะได้บัญญัติไว้เป็นอย่างอื่น"
                            }
                        ]
                    }

                ]
            },
            {
                "sectionTitle":"หมวด 3 โทษและวิธีการเพื่อความปลอดภัย",
                "subsections": [
                    {
                        "subsectionTitle":"ส่วนที่ 1 โทษ",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 18",
                                "description": "โทษสำหรับลงแก่ผู้กระทำความผิดมีดังนี้",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content": "ประหารชีวิต"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content": "จำคุก"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content": "กักขัง"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content": "ปรับ"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content": "ริบทรัพย์สิน"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "โทษประหารชีวิตและโทษจำคุกตลอดชีวิตมิให้นำมาใช้บังคับแก่ผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปี"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "ในกรณีผู้ซึ่งกระทำความผิดในขณะที่มีอายุต่ำกว่าสิบแปดปีได้กระทำความผิดที่มีระวางโทษประหารชีวิตหรือจำคุกตลอดชีวิต ให้ถือว่าระวางโทษดังกล่าวได้เปลี่ยนเป็นระวางโทษจำคุกห้าสิบปี๒"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 19",
                                "description": "ผู้ใดต้องโทษประหารชีวิต ให้ดำเนินการด้วยวิธีฉีดยาหรือสารพิษให้ตาย",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "หลักเกณฑ์และวิธีการประหารชีวิต ให้เป็นไปตามระเบียบที่กระทรวงยุติธรรมกำหนด โดยประกาศในราชกิจจานุเบกษา"
                                    }
                                ]
                                
                            },
                            {
                                "articleNumber":"มาตรา 20",
                                "description": "บรรดาความผิดที่กฎหมายกำหนดให้ลงโทษทั้งจำคุกและปรับด้วยนั้น ถ้าศาลเห็นสมควรจะลงแต่โทษจำคุกก็ได้"
                                
                            },
                            {
                                "articleNumber":"มาตรา 21",
                                "description": "ในการคำนวณระยะเวลาจำคุก ให้นับวันเริ่มจำคุกรวมคำนวณเข้าด้วย และให้นับเป็นหนึ่งวันเต็มโดยไม่ต้องคำนึงถึงจำนวนชั่วโมง",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ถ้าระยะเวลาที่คำนวณนั้นกำหนดเป็นเดือน ให้นับสามสิบวันเป็นหนึ่งเดือน ถ้ากำหนดเป็นปี ให้คำนวณตามปีปฏิทินในราชการ"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"เมื่อผู้ต้องคำพิพากษาถูกจำคุกครบกำหนดแล้ว ให้ปล่อยตัวในวันถัดจากวันที่ครบกำหนด"
                                    }
                                ]
                                
                            },
                            {
                                "articleNumber":"มาตรา 22",
                                "description": "โทษจำคุก ให้เริ่มแต่วันมีคำพิพากษา แต่ถ้าผู้ต้องคำพิพากษาถูกคุมขังก่อนศาลพิพากษา ให้หักจำนวนวันที่ถูกคุมขังออกจากระยะเวลาจำคุกตามคำพิพากษา เว้นแต่คำพิพากษานั้นจะกล่าวไว้เป็นอย่างอื่น",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ในกรณีที่คำพิพากษากล่าวไว้เป็นอย่างอื่น โทษจำคุกตามคำพิพากษาเมื่อรวมจำนวนวันที่ถูกคุมขังก่อนศาลพิพากษาในคดีเรื่องนั้นเข้าด้วยแล้ว ต้องไม่เกินอัตราโทษขั้นสูงของกฎหมายที่กำหนดไว้สำหรับความผิดที่ได้กระทำลงนั้น  ทั้งนี้ ไม่เป็นการกระทบกระเทือนบทบัญญัติในมาตรา ๗๑"
                                    }
                                ]
                                
                            },
                            {
                                "articleNumber":"มาตรา 23",
                                "description": "ผู้ใดกระทำความผิดซึ่งมีโทษจำคุก และในคดีนั้นศาลจะลงโทษจำคุกไม่เกินสามเดือน ถ้าไม่ปรากฏว่าผู้นั้นได้รับโทษจำคุกมาก่อน หรือปรากฏว่าได้รับโทษจำคุกมาก่อน แต่เป็นโทษสำหรับความผิดที่ได้กระทำโดยประมาท หรือความผิดลหุโทษ ศาลจะพิพากษาให้ลงโทษกักขังไม่เกินสามเดือนแทนโทษจำคุกนั้นก็ได้"
                                
                            },
                            {
                                "articleNumber":"มาตรา 24",
                                "description": "ผู้ใดต้องโทษกักขัง ให้กักตัวไว้ในสถานที่กักขังซึ่งกำหนดไว้อันมิใช่เรือนจำ สถานีตำรวจ หรือสถานที่ควบคุมผู้ต้องหาของพนักงานสอบสวน",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ถ้าศาลเห็นเป็นการสมควร จะสั่งในคำพิพากษาให้กักขังผู้กระทำความผิดไว้ในที่อาศัยของผู้นั้นเอง หรือของผู้อื่นที่ยินยอมรับผู้นั้นไว้ หรือสถานที่อื่นที่อาจกักขังได้ เพื่อให้เหมาะสมกับประเภทหรือสภาพของผู้ถูกกักขังก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"ถ้าความปรากฏแก่ศาลว่า การกักขังผู้ต้องโทษกักขังไว้ในสถานที่กักขังตามวรรคหนึ่งหรือวรรคสอง อาจก่อให้เกิดอันตรายต่อผู้นั้น หรือทำให้ผู้ซึ่งต้องพึ่งพาผู้ต้องโทษกักขังในการดำรงชีพได้รับความเดือดร้อนเกินสมควร หรือมีพฤติการณ์พิเศษประการอื่นที่แสดงให้เห็นว่าไม่สมควรกักขังผู้ต้องโทษกักขังในสถานที่ดังกล่าว ศาลจะมีคำสั่งให้กักขังผู้ต้องโทษกักขังในสถานที่อื่นซึ่งมิใช่ที่อยู่อาศัยของผู้นั้นเองโดยได้รับความยินยอมจากเจ้าของหรือผู้ครอบครองสถานที่ก็ได้ กรณีเช่นว่านี้ ให้ศาลมีอำนาจกำหนดเงื่อนไขอย่างหนึ่งอย่างใดให้ผู้ต้องโทษกักขังปฏิบัติ และหากเจ้าของหรือผู้ครอบครองสถานที่ดังกล่าวยินยอม ศาลอาจมีคำสั่งแต่งตั้งผู้นั้นเป็นผู้ควบคุมดูแลและให้ถือว่าผู้ที่ได้รับแต่งตั้งเป็นเจ้าพนักงานตามประมวลกฎหมายนี้"
                                    }
                                ]
                                
                            },
                            {
                                "articleNumber":"มาตรา 25",
                                "description": "ผู้ต้องโทษกักขังในสถานที่ซึ่งกำหนด จะได้รับการเลี้ยงดูจากสถานที่นั้น แต่ภายใต้ข้อบังคับของสถานที่ ผู้ต้องโทษกักขังมีสิทธิที่จะรับอาหารจากภายนอกโดยค่าใช้จ่ายของตนเอง ใช้เสื้อผ้าของตนเอง ได้รับการเยี่ยมอย่างน้อยวันละหนึ่งชั่วโมง และรับและส่งจดหมายได้",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ผู้ต้องโทษกักขังจะต้องทำงานตามระเบียบ ข้อบังคับและวินัย ถ้าผู้ต้องโทษกักขังประสงค์จะทำงานอย่างอื่นก็ให้อนุญาตให้เลือกทำได้ตามประเภทงานที่ตนสมัคร แต่ต้องไม่ขัดต่อระเบียบ ข้อบังคับ วินัย หรือความปลอดภัยของสถานที่นั้น"
                                    }
                                
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 26",
                                "description": "ถ้าผู้ต้องโทษกักขังถูกกักขังในที่อาศัยของผู้นั้นเอง หรือของผู้อื่นที่ยินยอมรับผู้นั้นไว้ ผู้ต้องโทษกักขังนั้นมีสิทธิที่จะดำเนินการในวิชาชีพหรืออาชีพของตนในสถานที่ดังกล่าวได้ ในการนี้ ศาลจะกำหนดเงื่อนไขให้ผู้ต้องโทษกักขังปฏิบัติอย่างหนึ่งอย่างใดหรือไม่ก็ได้ แล้วแต่ศาลจะเห็นสมควร"

                            },
                            {
                                "articleNumber":"มาตรา 27",
                                "description": "ถ้าในระหว่างที่ผู้ต้องโทษกักขังตามมาตรา ๒๓ ได้รับโทษกักขังอยู่ ความปรากฏแก่ศาลเอง หรือปรากฏแก่ศาลตามคำแถลงของพนักงานอัยการหรือผู้ควบคุมดูแลสถานที่กักขังว่า",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content":"ผู้ต้องโทษกักขังฝ่าฝืนระเบียบ ข้อบังคับ หรือวินัยของสถานที่กักขัง"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ผู้ต้องโทษกักขังไม่ปฏิบัติตามเงื่อนไขที่ศาลกำหนด หรือ"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"ผู้ต้องโทษกักขังต้องคำพิพากษาให้ลงโทษจำคุก"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ศาลอาจเปลี่ยนโทษกักขังเป็นโทษจำคุกมีกำหนดเวลาตามที่ศาลเห็นสมควร แต่ต้องไม่เกินกำหนดเวลาของโทษกักขังที่ผู้ต้องโทษกักขังจะต้องได้รับต่อไป"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 28",
                                "description": "ผู้ใดต้องโทษปรับ ผู้นั้นจะต้องชำระเงินตามจำนวนที่กำหนดไว้ในคำพิพากษาต่อศาล"

                            },
                            {
                                "articleNumber":"มาตรา 29",
                                "description": "ผู้ใดต้องโทษปรับและไม่ชำระค่าปรับภายในสามสิบวันนับแต่วันที่ศาลพิพากษา ผู้นั้นจะต้องถูกยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินเพื่อใช้ค่าปรับหรือมิฉะนั้นจะต้องถูกกักขังแทนค่าปรับ แต่ถ้าศาลเห็นเหตุอันควรสงสัยว่าผู้นั้นจะหลีกเลี่ยงไม่ชำระค่าปรับ ศาลจะสั่งเรียกประกันหรือจะสั่งให้กักขังผู้นั้นแทนค่าปรับไปพลางก่อนก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ความในวรรคสองของมาตรา ๒๔ มิให้นำมาใช้บังคับแก่การกักขังแทนค่าปรับ"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 29/1",
                                "description": "ในกรณีที่ผู้ต้องโทษปรับไม่ชำระค่าปรับภายในกำหนดเวลาตามมาตรา ๒๙ วรรคหนึ่ง ให้ศาลมีอำนาจออกหมายบังคับคดีเพื่อยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินของผู้นั้นเพื่อใช้ค่าปรับ",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"การบังคับคดีตามวรรคหนึ่ง ให้นำประมวลกฎหมายวิธีพิจารณาความแพ่งมาใช้บังคับโดยอนุโลม โดยให้เจ้าพนักงานศาลที่ได้รับแต่งตั้งและพนักงานอัยการเป็นผู้มีอำนาจหน้าที่ในการดำเนินการบังคับคดีและให้เจ้าพนักงานบังคับคดีมีอำนาจหน้าที่ยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินของผู้ต้องโทษปรับและขายทอดตลาดตามที่ได้รับแจ้งจากศาลหรือพนักงานอัยการ  ทั้งนี้ มิให้หน่วยงานของรัฐเรียกค่าฤชาธรรมเนียมหรือค่าใช้จ่ายจากผู้ดำเนินการบังคับคดี"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"การตรวจสอบหาทรัพย์สินของผู้ต้องโทษปรับโดยพนักงานอัยการเพื่อการบังคับคดีตามวรรคสอง ให้ปฏิบัติตามหลักเกณฑ์ วิธีการ และเงื่อนไขที่กำหนดในข้อบังคับของอัยการสูงสุด"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content":"บทบัญญัติมาตรานี้ไม่กระทบต่อการที่ศาลจะมีคำสั่งตามมาตรา ๒๙ วรรคหนึ่ง"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 30",
                                "description": "ในการกักขังแทนค่าปรับ ให้ถืออัตราห้าร้อยบาทต่อหนึ่งวัน และไม่ว่าในกรณีความผิดกระทงเดียวหรือหลายกระทง ห้ามกักขังเกินกำหนดหนึ่งปี เว้นแต่ในกรณีที่ศาลพิพากษาให้ปรับตั้งแต่สองแสนบาทขึ้นไป ศาลจะสั่งให้กักขังแทนค่าปรับเป็นระยะเวลาเกินกว่าหนึ่งปีแต่ไม่เกินสองปีก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ในการคำนวณระยะเวลานั้น ให้นับวันเริ่มกักขังแทนค่าปรับรวมเข้าด้วยและให้นับเป็นหนึ่งวันเต็มโดยไม่ต้องคำนึงถึงจำนวนชั่วโมง"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"ในกรณีที่ผู้ต้องโทษปรับถูกคุมขังก่อนศาลพิพากษา ให้หักจำนวนวันที่ถูกคุมขังนั้นออกจากจำนวนเงินค่าปรับ โดยถืออัตราห้าร้อยบาทต่อหนึ่งวัน เว้นแต่ผู้นั้นต้องคำพิพากษาให้ลงโทษทั้งจำคุกและปรับ ในกรณีเช่นว่านี้ ถ้าจะต้องหักจำนวนวันที่ถูกคุมขังออกจากเวลาจำคุกตามมาตรา 22 ก็ให้หักออกเสียก่อนเหลือเท่าใดจึงให้หักออกจากเงินค่าปรับ"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content":"เมื่อผู้ต้องโทษปรับถูกกักขังแทนค่าปรับครบกำหนดแล้ว ให้ปล่อยตัวในวันถัดจากวันที่ครบกำหนด ถ้านำเงินค่าปรับมาชำระครบแล้ว ให้ปล่อยตัวไปทันที"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 30/1",
                                "description": "ในกรณีที่ศาลพิพากษาปรับ ผู้ต้องโทษปรับซึ่งมิใช่นิติบุคคลและไม่มีเงินชำระค่าปรับอาจยื่นคำร้องต่อศาลชั้นต้นที่พิพากษาคดีเพื่อขอทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับ หรือถ้าความปรากฏแก่ศาลในขณะที่พิพากษาคดีว่าผู้ต้องโทษปรับรายใดอยู่ในเกณฑ์ที่จะทำงานบริการสังคมหรือทำงานสาธารณประโยชน์ตามมาตรานี้ได้ และถ้าผู้ต้องโทษปรับยินยอม ศาลจะมีคำสั่งให้ผู้นั้นทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"การพิจารณาคำร้องตามวรรคแรก เมื่อศาลได้พิจารณาถึงฐานะการเงิน ประวัติและสภาพความผิดของผู้ต้องโทษปรับแล้ว เห็นเป็นการสมควร ศาลจะมีคำสั่งให้ผู้นั้นทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับก็ได้  ทั้งนี้ ภายใต้การดูแลของพนักงานคุมประพฤติ เจ้าหน้าที่ของรัฐ หน่วยงานของรัฐ หรือองค์การซึ่งมีวัตถุประสงค์เพื่อการบริการสังคม การกุศลสาธารณะหรือสาธารณประโยชน์ที่ยินยอมรับดูแล"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"กรณีที่ศาลมีคำสั่งให้ผู้ต้องโทษปรับทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับ ให้ศาลกำหนดลักษณะหรือประเภทของงาน ผู้ดูแลการทำงาน วันเริ่มทำงาน ระยะเวลาทำงาน และจำนวนชั่วโมงที่ถือเป็นการทำงานหนึ่งวัน  ทั้งนี้ โดยคำนึงถึงเพศ อายุ ประวัติ การนับถือศาสนา ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ สิ่งแวดล้อมหรือสภาพความผิดของผู้ต้องโทษปรับประกอบด้วย และศาลจะกำหนดเงื่อนไขอย่างหนึ่งอย่างใดให้ผู้ต้องโทษปรับปฏิบัติเพื่อแก้ไขฟื้นฟูหรือป้องกันมิให้ผู้นั้นกระทำความผิดขึ้นอีกก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content":"ถ้าภายหลังความปรากฏแก่ศาลว่าพฤติการณ์เกี่ยวกับการทำงานบริการสังคมหรือทำงานสาธารณประโยชน์ของผู้ต้องโทษปรับได้เปลี่ยนแปลงไป ศาลอาจแก้ไขเปลี่ยนแปลงคำสั่งที่กำหนดไว้นั้นก็ได้ตามที่เห็นสมควร"
                                    },
                                    {
                                        "partTitle":"วรรค 5",
                                        "content":"ในการกำหนดระยะเวลาทำงานแทนค่าปรับตามวรรคสาม ให้นำบทบัญญัติมาตรา ๓๐ มาใช้บังคับโดยอนุโลม และในกรณีที่ศาลมิได้กำหนดให้ผู้ต้องโทษปรับทำงานติดต่อกันไป การทำงานดังกล่าวต้องอยู่ภายในกำหนดระยะเวลาสองปีนับแต่วันเริ่มทำงานตามที่ศาลกำหนด"
                                    },
                                    {
                                        "partTitle":"วรรค 6",
                                        "content":"เพื่อประโยชน์ในการกำหนดจำนวนชั่วโมงทำงานตามวรรคสาม ให้ประธานศาลฎีกามีอำนาจออกระเบียบราชการฝ่ายตุลาการศาลยุติธรรมกำหนดจำนวนชั่วโมงที่ถือเป็นการทำงานหนึ่งวัน สำหรับงานบริการสังคมหรืองานสาธารณประโยชน์แต่ละประเภทได้ตามที่เห็นสมควร"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 30/2",
                                "description": "ถ้าภายหลังศาลมีคำสั่งอนุญาตตามมาตรา ๓๐/๑ แล้ว ความปรากฏแก่ศาลเองหรือความปรากฏตามคำแถลงของโจทก์หรือเจ้าพนักงานว่าผู้ต้องโทษปรับมีเงินพอชำระค่าปรับได้ในเวลาที่ยื่นคำร้องตามมาตรา ๓๐/๑ หรือฝ่าฝืนหรือไม่ปฏิบัติตามคำสั่งหรือเงื่อนไขที่ศาลกำหนด ศาลจะเพิกถอนคำสั่งอนุญาตดังกล่าวและปรับ หรือกักขังแทนค่าปรับ โดยให้หักจำนวนวันที่ทำงานมาแล้วออกจากจำนวนเงินค่าปรับก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ในระหว่างการทำงานบริการสังคมหรือทำงานสาธารณประโยชน์แทนค่าปรับ หากผู้ต้องโทษปรับไม่ประสงค์จะทำงานดังกล่าวต่อไป อาจขอเปลี่ยนเป็นรับโทษปรับ หรือกักขังแทนค่าปรับก็ได้ ในกรณีนี้ให้ศาลมีคำสั่งอนุญาตตามคำร้อง โดยให้หักจำนวนวันที่ทำงานมาแล้วออกจากจำนวนเงินค่าปรับ"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 30/3",
                                "description": "คำสั่งศาลตามมาตรา ๓๐/๑ และมาตรา ๓๐/๒ ให้เป็นที่สุด"

                            },
                            {
                                "articleNumber":"มาตรา 31",
                                "description": "ในกรณีที่ศาลจะพิพากษาให้ปรับผู้กระทำความผิดหลายคน ในความผิดอันเดียวกัน ในกรณีเดียวกัน ให้ศาลลงโทษปรับเรียงตามรายตัวบุคคล"

                            },
                            {
                                "articleNumber":"มาตรา 32",
                                "description": "ทรัพย์สินใดที่กฎหมายบัญญัติไว้ว่า ผู้ใดทำหรือมีไว้เป็นความผิด ให้ริบเสียทั้งสิ้น ไม่ว่าเป็นของผู้กระทำความผิด และมีผู้ถูกลงโทษตามคำพิพากษาหรือไม่"

                            },
                            {
                                "articleNumber":"มาตรา 33",
                                "description": "ในการริบทรัพย์สิน นอกจากศาลจะมีอำนาจริบตามกฎหมายที่บัญญัติไว้โดยเฉพาะแล้ว ให้ศาลมีอำนาจสั่งให้ริบทรัพย์สินดังต่อไปนี้อีกด้วย คือ",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content":"ทรัพย์สินซึ่งบุคคลได้ใช้ หรือมีไว้เพื่อใช้ในการกระทำความผิด หรือ"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ทรัพย์สินซึ่งบุคคลได้มาโดยได้กระทำความผิด"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"เว้นแต่ทรัพย์สินเหล่านี้เป็นทรัพย์สินของผู้อื่นซึ่งมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 34",
                                "description": "บรรดาทรัพย์สิน",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content":"ซึ่งได้ให้ตามความในมาตรา 143 มาตรา 144 มาตรา 149 มาตรา 150 มาตรา 167 มาตรา 201 หรือมาตรา 202 หรือ"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ซึ่งได้ให้เพื่อจูงใจบุคคลให้กระทำความผิด หรือเพื่อเป็นรางวัลในการที่บุคคลได้กระทำความผิด"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ให้ริบเสียทั้งสิ้น เว้นแต่ทรัพย์สินนั้นเป็นของผู้อื่นซึ่งมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 35",
                                "description": "ทรัพย์สินซึ่งศาลพิพากษาให้ริบให้ตกเป็นของแผ่นดิน แต่ศาลจะพิพากษาให้ทำให้ทรัพย์สินนั้นใช้ไม่ได้หรือทำลายทรัพย์สินนั้นเสียก็ได้"

                            },
                            {
                                "articleNumber":"มาตรา 36",
                                "description": "ในกรณีที่ศาลสั่งให้ริบทรัพย์สินตามมาตรา ๓๓ หรือ มาตรา ๓๔ ไปแล้ว หากปรากฏในภายหลังโดยคำเสนอของเจ้าของแท้จริงว่า ผู้เป็นเจ้าของแท้จริงมิได้รู้เห็นเป็นใจด้วยในการกระทำความผิด ก็ให้ศาลสั่งให้คืนทรัพย์สิน ถ้าทรัพย์สินนั้นยังคงมีอยู่ในความครอบครองของเจ้าพนักงาน แต่คำเสนอของเจ้าของแท้จริงนั้นจะต้องกระทำต่อศาลภายในหนึ่งปีนับแต่วันคำพิพากษาถึงที่สุด"

                            },
                            {
                                "articleNumber":"มาตรา 37",
                                "description": "ถ้าผู้ที่ศาลสั่งให้ส่งทรัพย์สินที่ริบไม่ส่งภายในเวลาที่ศาลกำหนด ให้ศาลมีอำนาจสั่งดังต่อไปนี้",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content":"ให้ยึดทรัพย์สินนั้น"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ให้ชำระราคาหรือสั่งยึดทรัพย์สินอื่นของผู้นั้นชดใช้ราคาจนเต็ม หรือ"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"ในกรณีที่ศาลเห็นว่า ผู้นั้นจะส่งทรัพย์สินที่สั่งให้ส่งได้ แต่ไม่ส่ง หรือชำระราคาทรัพย์สินนั้นได้ แต่ไม่ชำระ ให้ศาลมีอำนาจกักขังผู้นั้นไว้จนกว่าจะปฏิบัติตามคำสั่ง แต่ไม่เกินหนึ่งปี แต่ถ้าภายหลังปรากฏแก่ศาลเอง หรือโดยคำเสนอของผู้นั้นว่า ผู้นั้นไม่สามารถส่งทรัพย์สินหรือชำระราคาได้ ศาลจะสั่งให้ปล่อยตัวผู้นั้นไปก่อนครบกำหนดก็ได้"
                                    }
                                ]

                            },
                            {
                                "articleNumber":"มาตรา 38",
                                "description": "โทษให้เป็นอันระงับไปด้วยความตายของผู้กระทำความผิด"

                            }
                        ]
                    },
                    {
                        "subsectionTitle":"ส่วนที่ 2 วิธีการเพื่อความปลอดภัย",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 39",
                                "description":"วิธีการเพื่อความปลอดภัย มีดังนี้",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content":"กักกัน"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ห้ามเข้าเขตกำหนด"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"เรียกประกันทัณฑ์บน"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content":"คุมตัวไว้ในสถานพยาบาล"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content":"ห้ามการประกอบอาชีพบางอย่าง"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 40",
                                "description":"กักกัน คือการควบคุมผู้กระทำความผิดติดนิสัยไว้ภายในเขตกำหนด เพื่อป้องกันการกระทำความผิด เพื่อดัดนิสัย และเพื่อฝึกหัดอาชีพ"
                            },
                            {
                                "articleNumber":"มาตรา 41",
                                "description":"ผู้ใดเคยถูกศาลพิพากษาให้กักกันมาแล้ว หรือเคยถูกศาลพิพากษาให้ลงโทษจำคุกไม่ต่ำกว่าหกเดือนมาแล้วไม่น้อยกว่าสองครั้งในความผิดดังต่อไปนี้ คือ",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content":"ความผิดเกี่ยวกับความสงบสุขของประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๐๙ ถึงมาตรา ๒๑๖"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ ถึงมาตรา ๒๒๔"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"ความผิดเกี่ยวกับเงินตรา ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๖"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content":"ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ ถึงมาตรา ๒๘๖"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content":"ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐ มาตรา ๒๙๒ ถึงมาตรา ๒๙๔"
                                    },
                                    {
                                        "partTitle":"(6)",
                                        "content":"ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๙"
                                    },
                                    {
                                        "partTitle":"(7)",
                                        "content":"ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ ถึงมาตรา ๓๒๐"
                                    },
                                    {
                                        "partTitle":"(8)",
                                        "content":"ความผิดเกี่ยวกับทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๔๐ มาตรา ๓๕๔ และมาตรา ๓๕๗"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"และภายในเวลาสิบปีนับแต่วันที่ผู้นั้นได้พ้นจากการกักกัน หรือพ้นโทษ แล้วแต่กรณี ผู้นั้นได้กระทำความผิดอย่างหนึ่งอย่างใดในบรรดาที่ระบุไว้นั้นอีกจนศาลพิพากษาลงโทษจำคุกไม่ต่ำกว่าหกเดือนสำหรับการกระทำความผิดนั้น ศาลอาจถือว่า ผู้นั้นเป็นผู้กระทำความผิดติดนิสัย และจะพิพากษาให้กักกันมีกำหนดเวลาไม่น้อยกว่าสามปีและไม่เกินสิบปีก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"ความผิดซึ่งผู้กระทำได้กระทำในขณะที่มีอายุต่ำกว่าสิบแปดปีนั้น มิให้ถือเป็นความผิดที่จะนำมาพิจารณากักกันตามมาตรานี้"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 42",
                                "description":"ในการคำนวณระยะเวลากักกัน ให้นับวันที่ศาลพิพากษาเป็นวันเริ่มกักกัน แต่ถ้ายังมีโทษจำคุกหรือกักขังที่ผู้ต้องกักกันนั้นจะต้องรับอยู่ก็ให้จำคุกหรือกักขังเสียก่อน และให้นับวันถัดจากวันที่พ้นโทษจำคุกหรือพ้นจากกักขังเป็นวันเริ่มกักกัน",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ระยะเวลากักกัน และการปล่อยตัวผู้ถูกกักกัน ให้นำบทบัญญัติมาตรา ๒๑ มาใช้บังคับโดยอนุโลม"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 43",
                                "description":"การฟ้องขอให้กักกันเป็นอำนาจของพนักงานอัยการโดยเฉพาะ และจะขอรวมกันไปในฟ้องคดีอันเป็นมูลให้เกิดอำนาจฟ้องขอให้กักกันหรือจะฟ้องภายหลังก็ได้"
                            },
                            {
                                "articleNumber":"มาตรา 44",
                                "description":"ห้ามเข้าเขตกำหนด คือการห้ามมิให้เข้าไปในท้องที่หรือสถานที่ที่กำหนดไว้ในคำพิพากษา"
                            },
                            {
                                "articleNumber":"มาตรา 45",
                                "description":"เมื่อศาลพิพากษาให้ลงโทษผู้ใด และศาลเห็นสมควรเพื่อความปลอดภัยของประชาชน ไม่ว่าจะมีคำขอหรือไม่ ศาลอาจสั่งในคำพิพากษาว่าเมื่อผู้นั้นพ้นโทษตามคำพิพากษาแล้ว ห้ามมิให้ผู้นั้นเข้าในเขตกำหนดเป็นเวลาไม่เกินห้าปี"
                            },
                            {
                                "articleNumber":"มาตรา 46",
                                "description":"ถ้าความปรากฏแก่ศาลตามข้อเสนอของพนักงานอัยการว่าผู้ใดจะก่อเหตุร้ายให้เกิดภยันตรายแก่บุคคลหรือทรัพย์สินของผู้อื่น หรือจะกระทำการใดให้เกิดความเสียหายแก่สิ่งแวดล้อมหรือทรัพยากรธรรมชาติตามกฎหมายเกี่ยวกับสิ่งแวดล้อมและทรัพยากรธรรมชาติ ในการพิจารณาคดีความผิดใด ไม่ว่าศาลจะลงโทษผู้ถูกฟ้องหรือไม่ก็ตาม เมื่อมีเหตุอันควรเชื่อว่าผู้ถูกฟ้องน่าจะก่อเหตุร้ายให้เกิดภยันตรายแก่บุคคลหรือทรัพย์สินของผู้อื่น หรือจะกระทำความผิดให้เกิดความเสียหายแก่สิ่งแวดล้อมหรือทรัพยากรธรรมชาติตามกฎหมายเกี่ยวกับสิ่งแวดล้อมและทรัพยากรธรรมชาติ ให้ศาลมีอำนาจที่จะสั่งผู้นั้นให้ทำทัณฑ์บนโดยกำหนดจำนวนเงินไม่เกินกว่าห้าหมื่นบาทว่าผู้นั้นจะไม่ก่อเหตุร้ายหรือจะไม่กระทำความผิดดังกล่าวแล้วตลอดเวลาที่ศาลกำหนด แต่ไม่เกินสองปี และจะสั่งให้มีประกันด้วยหรือไม่ก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ถ้าผู้นั้นไม่ยอมทำทัณฑ์บนหรือหาประกันไม่ได้ ให้ศาลมีอำนาจสั่งกักขังผู้นั้นจนกว่าจะทำทัณฑ์บนหรือหาประกันได้ แต่ไม่ให้กักขังเกินกว่าหกเดือน หรือจะสั่งห้ามผู้นั้นเข้าในเขตกำหนดตามมาตรา ๔๖ ก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"การกระทำของผู้ซึ่งมีอายุต่ำกว่าสิบแปดปีมิให้อยู่ในบังคับแห่งบทบัญญัติตามมาตรานี้"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 47",
                                "description":"ถ้าผู้ทำทัณฑ์บนตามความในมาตรา ๔๖ กระทำผิดทัณฑ์บน ให้ศาลมีอำนาจสั่งให้ผู้นั้นชำระเงินไม่เกินจำนวนที่ได้กำหนดไว้ในทัณฑ์บน ถ้าผู้นั้นไม่ชำระให้นำบทบัญญัติในมาตรา ๒๙ และมาตรา ๓๐ มาใช้บังคับ"
                            },
                            {
                                "articleNumber":"มาตรา 48",
                                "description":"ถ้าศาลเห็นว่า การปล่อยตัวผู้มีจิตบกพร่อง โรคจิตหรือจิตฟั่นเฟือน ซึ่งไม่ต้องรับโทษหรือได้รับการลดโทษตามมาตรา ๖๕ จะเป็นการไม่ปลอดภัยแก่ประชาชน ศาลจะสั่งให้ส่งไปคุมตัวไว้ในสถานพยาบาลก็ได้ และคำสั่งนี้ศาลจะเพิกถอนเสียเมื่อใดก็ได้"
                            },
                            {
                                "articleNumber":"มาตรา 49",
                                "description":"ในกรณีที่ศาลพิพากษาลงโทษจำคุก หรือพิพากษาว่ามีความผิดแต่รอการกำหนดโทษ หรือรอการลงโทษบุคคลใด ถ้าศาลเห็นว่าบุคคลนั้นได้กระทำความผิดเกี่ยวเนื่องกับการเสพย์สุราเป็นอาจิณ หรือการเป็นผู้ติดยาเสพย์ติดให้โทษ ศาลจะกำหนดในคำพิพากษาว่า บุคคลนั้นจะต้องไม่เสพย์สุรา ยาเสพย์ติดให้โทษอย่างหนึ่งอย่างใด หรือทั้งสองอย่าง ภายในระยะเวลาไม่เกินสองปีนับแต่วันพ้นโทษ หรือวันปล่อยตัวเพราะรอการกำหนดโทษ หรือรอการลงโทษก็ได้",
                                "splitSections": [
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"ในกรณีที่บุคคลดังกล่าวในวรรคแรกไม่ปฏิบัติตามที่ศาลกำหนด ศาลจะสั่งให้ส่งไปคุมตัวไว้ในสถานพยาบาลเป็นเวลาไม่เกินสองปีก็ได้"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 50",
                                "description":"เมื่อศาลพิพากษาให้ลงโทษผู้ใด ถ้าศาลเห็นว่าผู้นั้นกระทำความผิดโดยอาศัยโอกาสจากการประกอบอาชีพหรือวิชาชีพ หรือเนื่องจากการประกอบอาชีพหรือวิชาชีพ และเห็นว่าหากผู้นั้นประกอบอาชีพหรือวิชาชีพนั้นต่อไปอาจจะกระทำความผิดเช่นนั้นขึ้นอีก ศาลจะสั่งไว้ในคำพิพากษาห้ามการประกอบอาชีพหรือวิชาชีพนั้นมีกำหนดเวลาไม่เกินห้าปีนับแต่วันพ้นโทษไปแล้วก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"ส่วนที่ 3 วิธีเพิ่มโทษ ลดโทษ และการรอการลงโทษ",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 51",
                                "description":"ในการเพิ่มโทษ มิให้เพิ่มขึ้นถึงประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกเกินห้าสิบปี"
                            },
                            {
                                "articleNumber":"มาตรา 52",
                                "description":"ในการลดโทษประหารชีวิต ไม่ว่าจะเป็นการลดมาตราส่วนโทษหรือลดโทษที่จะลง ให้ลดดังต่อไปนี้",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content":"ถ้าจะลดหนึ่งในสามให้ลดเป็นโทษจำคุกตลอดชีวิต"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ถ้าจะลดกึ่งหนึ่ง ให้ลดเป็นโทษจำคุกตลอดชีวิต หรือโทษจำคุกตั้งแต่ยี่สิบห้าปีถึงห้าสิบปี"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 53",
                                "description":"ในการลดโทษจำคุกตลอดชีวิต ไม่ว่าจะเป็นการลดมาตราส่วนโทษหรือลดโทษที่จะลง ให้เปลี่ยนโทษจำคุกตลอดชีวิตเป็นโทษจำคุกห้าสิบปี"
                            },
                            {
                                "articleNumber":"มาตรา 54",
                                "description":"ในการคำนวณการเพิ่มโทษหรือลดโทษที่จะลง ให้ศาลตั้งกำหนดโทษที่จะลงแก่จำเลยเสียก่อนแล้วจึงเพิ่มหรือลด ถ้ามีทั้งการเพิ่มและการลดโทษที่จะลง ให้เพิ่มก่อนแล้วจึงลดจากผลที่เพิ่มแล้วนั้น ถ้าส่วนของการเพิ่มเท่ากับหรือมากกว่าส่วนของการลด และศาลเห็นสมควรจะไม่เพิ่มไม่ลดก็ได้"
                            },
                            {
                                "articleNumber":"มาตรา 55",
                                "description":"ถ้าโทษจำคุกที่ผู้กระทำความผิดจะต้องรับมีกำหนดเวลาเพียงสามเดือนหรือน้อยกว่า ศาลจะกำหนดโทษจำคุกให้น้อยลงอีกก็ได้ หรือถ้าโทษจำคุกที่ผู้กระทำความผิดจะต้องรับมีกำหนดเวลาเพียงสามเดือนหรือน้อยกว่าและมีโทษปรับด้วย ศาลจะกำหนดโทษจำคุกให้น้อยลง หรือจะยกโทษจำคุกเสีย คงให้ปรับแต่อย่างเดียวก็ได้"
                            },
                            {
                                "articleNumber":"มาตรา 56",
                                "description":"ผู้ใดกระทำความผิดซึ่งมีโทษจำคุกหรือปรับ และในคดีนั้นศาลจะลงโทษจำคุกไม่เกินห้าปีไม่ว่าจะลงโทษปรับด้วยหรือไม่ก็ตามหรือลงโทษปรับ ถ้าปรากฏว่าผู้นั้น",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content":"ไม่เคยรับโทษจำคุกมาก่อน หรือ"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"เคยรับโทษจำคุกมาก่อนแต่เป็นโทษสำหรับความผิดที่ได้กระทำโดยประมาท หรือความผิดลหุโทษ หรือเป็นโทษจำคุกไม่เกินหกเดือน หรือ"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"เคยรับโทษจำคุกมาก่อนแต่พ้นโทษจำคุกมาแล้วเกินกว่าห้าปี แล้วมากระทำความผิดอีก โดยความผิดในครั้งหลังเป็นความผิดที่ได้กระทำโดยประมาทหรือความผิดลหุโทษ"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"และเมื่อศาลได้คำนึงถึงอายุ ประวัติ ความประพฤติ สติปัญญา การศึกษาอบรม สุขภาพ ภาวะแห่งจิต นิสัย อาชีพ และสิ่งแวดล้อมของผู้นั้น หรือสภาพความผิด หรือการรู้สึกความผิด และพยายามบรรเทาผลร้ายที่เกิดขึ้น หรือเหตุอื่นอันควรปรานีแล้ว ศาลจะพิพากษาว่าผู้นั้นมีความผิดแต่รอการกำหนดโทษหรือกำหนดโทษแต่รอการลงโทษไว้ ไม่ว่าจะเป็นโทษจำคุกหรือปรับอย่างหนึ่งอย่างใดหรือทั้งสองอย่าง เพื่อให้โอกาสกลับตัวภายในระยะเวลาที่ศาลจะได้กำหนดแต่ต้องไม่เกินห้าปีนับแต่วันที่ศาลพิพากษา โดยจะกำหนดเงื่อนไขเพื่อคุมความประพฤติของผู้นั้นด้วยหรือไม่ก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content":"เงื่อนไขเพื่อคุมความประพฤติของผู้กระทำความผิดตามวรรคหนึ่ง ศาลอาจกำหนดข้อเดียวหรือหลายข้อตามควรแก่กรณีได้ ดังต่อไปนี้"
                                    },
                                    {
                                        "partTitle":"(1)",
                                        "content":"ให้ไปรายงานตัวต่อเจ้าพนักงานที่ศาลระบุไว้เป็นครั้งคราว เพื่อเจ้าพนักงานจะได้สอบถาม แนะนำ ช่วยเหลือ หรือตักเตือนตามที่เห็นสมควรในเรื่องความประพฤติและการประกอบอาชีพ หรือจัดให้กระทำกิจกรรมบริการสังคมหรือสาธารณประโยชน์"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ให้ฝึกหัดหรือทำงานอาชีพอันเป็นกิจจะลักษณะ"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"ให้ละเว้นการคบหาสมาคมหรือการประพฤติใดอันอาจนำไปสู่การกระทำความผิดในทำนองเดียวกันอีก"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content":"ให้ไปรับการบำบัดรักษาการติดยาเสพติดให้โทษ ความบกพร่องทางร่างกายหรือจิตใจ หรือความเจ็บป่วยอย่างอื่น ณ สถานที่และตามระยะเวลาที่ศาลกำหนด"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content":"ให้เข้ารับการฝึกอบรม ณ สถานที่และตามระยะเวลาที่ศาลกำหนด"
                                    },
                                    {
                                        "partTitle":"(6)",
                                        "content":"ห้ามออกนอกสถานที่อยู่อาศัย หรือห้ามเข้าในสถานที่ใดในระหว่างเวลาที่ศาลกำหนด  ทั้งนี้ จะใช้อุปกรณ์อิเล็กทรอนิกส์หรืออุปกรณ์อื่นใดที่สามารถใช้ตรวจสอบหรือจำกัดการเดินทางด้วยก็ได้"
                                    },
                                    {
                                        "partTitle":"(7)",
                                        "content":"ให้ชดใช้ค่าสินไหมทดแทนหรือเยียวยาความเสียหายโดยวิธีอื่นให้แก่ผู้เสียหายตามที่ผู้กระทำความผิดและผู้เสียหายตกลงกัน"
                                    },
                                    {
                                        "partTitle":"(8)",
                                        "content":"ให้แก้ไขฟื้นฟูหรือเยียวยาความเสียหายที่เกิดแก่ทรัพยากรธรรมชาติ หรือสิ่งแวดล้อม หรือชดใช้ค่าเสียหายเพื่อการดังกล่าว"
                                    },
                                    {
                                        "partTitle":"(9)",
                                        "content":"ให้ทำทัณฑ์บนโดยกำหนดจำนวนเงินตามที่ศาลเห็นสมควรว่าจะไม่ก่อเหตุร้าย หรือก่อให้เกิดภยันตรายแก่บุคคลอื่นหรือทรัพย์สิน"
                                    },
                                    {
                                        "partTitle":"(10)",
                                        "content":"เงื่อนไขอื่น ๆ ตามที่ศาลเห็นสมควรกำหนดเพื่อแก้ไข ฟื้นฟู หรือป้องกันมิให้ผู้กระทำความผิดกระทำหรือมีโอกาสกระทำความผิดขึ้นอีก หรือเงื่อนไขในการเยียวยาผู้เสียหายตามที่เห็นสมควร"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content":"เงื่อนไขตามที่ศาลได้กำหนดตามความในวรรคสองนั้น ถ้าภายหลังความปรากฏแก่ศาลตามคำขอของผู้กระทำความผิด ผู้แทนโดยชอบธรรมของผู้นั้น ผู้อนุบาลของผู้นั้น พนักงานอัยการหรือเจ้าพนักงานว่าพฤติการณ์ที่เกี่ยวแก่การควบคุมความประพฤติของผู้กระทำความผิดได้เปลี่ยนแปลงไป เมื่อศาลเห็นสมควร ศาลอาจแก้ไขเพิ่มเติมหรือเพิกถอนข้อหนึ่งข้อใดเสียก็ได้ หรือจะกำหนดเงื่อนไขข้อใดตามที่กล่าวในวรรคสองที่ศาลยังมิได้กำหนดไว้เพิ่มเติมขึ้นอีกก็ได้ หรือถ้ามีการกระทำผิดทัณฑ์บนให้นำบทบัญญัติมาตรา ๔๗ มาใช้บังคับโดยอนุโลม"
                                    }
                                ]
                            },
                            {
                                "articleNumber":"มาตรา 57",
                                "description":"เมื่อความปรากฏแก่ศาลเอง หรือความปรากฏตามคำแถลงของพนักงานอัยการหรือเจ้าพนักงานว่า ผู้กระทำความผิดไม่ปฏิบัติตามเงื่อนไขดังที่ศาลกำหนดตามมาตรา 56 ศาลอาจตักเตือนผู้กระทำความผิด หรือจะกำหนดการลงโทษที่ยังไม่ได้กำหนดหรือลงโทษซึ่งรอไว้นั้นก็ได้"
                            },
                            {
                                "articleNumber":"มาตรา 58",
                                "description":"เมื่อความปรากฏแก่ศาลเอง หรือความปรากฏตามคำแถลงของโจทก์หรือเจ้าพนักงานว่า ภายในเวลาที่ศาลกำหนดตามมาตรา ๕๖ ผู้ที่ถูกศาลพิพากษาได้กระทำความผิดอันมิใช่ความผิดที่ได้กระทำโดยประมาทหรือความผิดลหุโทษ และศาลพิพากษาให้ลงโทษจำคุกสำหรับความผิดนั้น ให้ศาลที่พิพากษาคดีหลังกำหนดโทษที่รอการกำหนดไว้ในคดีก่อนบวกเข้ากับโทษในคดีหลัง หรือบวกโทษที่รอการลงโทษไว้ในคดีก่อนเข้ากับโทษในคดีหลัง แล้วแต่กรณี",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content":"แต่ถ้าภายในเวลาที่ศาลได้กำหนดตามมาตรา ๕๖ ผู้นั้นมิได้กระทำความผิดดังกล่าวมาในวรรคแรก ให้ผู้นั้นพ้นจากการที่จะถูกกำหนดโทษ หรือถูกลงโทษในคดีนั้น แล้วแต่กรณี"
                                    }
                                ]
                            }
                        ]
                    }

                ]
            
            },
            {
                "sectionTitle":"หมวด 4 ความรับผิดในทางอาญา",
                "subsection": [
                    {
                        "subsectionTitle":"มาตรา 59",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 59",
                                "description":"บุคคลจะต้องรับผิดในทางอาญาก็ต่อเมื่อได้กระทำโดยเจตนา เว้นแต่จะได้กระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติให้ต้องรับผิดเมื่อได้กระทำโดยประมาท หรือเว้นแต่ในกรณีที่กฎหมายบัญญัติไว้โดยแจ้งชัดให้ต้องรับผิดแม้ได้กระทำโดยไม่มีเจตนา",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "กระทำโดยเจตนา ได้แก่กระทำโดยรู้สำนึกในการที่กระทำและในขณะเดียวกันผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้น"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "ถ้าผู้กระทำมิได้รู้ข้อเท็จจริงอันเป็นองค์ประกอบของความผิด จะถือว่าผู้กระทำประสงค์ต่อผล หรือย่อมเล็งเห็นผลของการกระทำนั้นมิได้"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content": "กระทำโดยประมาท ได้แก่กระทำความผิดมิใช่โดยเจตนา แต่กระทำโดยปราศจากความระมัดระวังซึ่งบุคคลในภาวะเช่นนั้นจักต้องมีตามวิสัยและพฤติการณ์ และผู้กระทำอาจใช้ความระมัดระวังเช่นว่านั้นได้ แต่หาได้ใช้ให้เพียงพอไม่"
                                    },
                                    {
                                        "partTitle":"วรรค 5",
                                        "content": "การกระทำ ให้หมายความรวมถึงการให้เกิดผลอันหนึ่งอันใดขึ้นโดยงดเว้นการที่จักต้องกระทำเพื่อป้องกันผลนั้นด้วย"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 60",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 60",
                                "description":"ผู้ใดเจตนาที่จะกระทำต่อบุคคลหนึ่ง แต่ผลของการกระทำเกิดแก่อีกบุคคลหนึ่งโดยพลาดไป ให้ถือว่าผู้นั้นกระทำโดยเจตนาแก่บุคคลซึ่งได้รับผลร้ายจากการกระทำนั้น แต่ในกรณีที่กฎหมายบัญญัติให้ลงโทษหนักขึ้น เพราะฐานะของบุคคลหรือเพราะความสัมพันธ์ระหว่างผู้กระทำกับบุคคลที่ได้รับผลร้าย มิให้นำกฎหมายนั้นมาใช้บังคับเพื่อลงโทษผู้กระทำให้หนักขึ้น"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 61",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 61",
                                "description":"ผู้ใดเจตนาจะกระทำต่อบุคคลหนึ่ง แต่ได้กระทำต่ออีกบุคคลหนึ่งโดยสำคัญผิด ผู้นั้นจะยกเอาความสำคัญผิดเป็นข้อแก้ตัวว่ามิได้กระทำโดยเจตนาหาได้ไม่"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 62",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 62",
                                "description":"ข้อเท็จจริงใด ถ้ามีอยู่จริงจะทำให้การกระทำไม่เป็นความผิด หรือทำให้ผู้กระทำไม่ต้องรับโทษ หรือได้รับโทษน้อยลง แม้ข้อเท็จจริงนั้นจะไม่มีอยู่จริง แต่ผู้กระทำสำคัญผิดว่ามีอยู่จริง ผู้กระทำย่อมไม่มีความผิด หรือได้รับยกเว้นโทษ หรือได้รับโทษน้อยลง แล้วแต่กรณี",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ถ้าความไม่รู้ข้อเท็จจริงตามความในวรรคสามแห่งมาตรา ๕๙ หรือความสำคัญผิดว่ามีอยู่จริงตามความในวรรคแรก ได้เกิดขึ้นด้วยความประมาทของผู้กระทำความผิด ให้ผู้กระทำรับผิดฐานกระทำโดยประมาท ในกรณีที่กฎหมายบัญญัติไว้โดยเฉพาะว่า การกระทำนั้นผู้กระทำจะต้องรับโทษแม้กระทำโดยประมาท"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "บุคคลจะต้องรับโทษหนักขึ้นโดยอาศัยข้อเท็จจริงใด บุคคลนั้นจะต้องได้รู้ข้อเท็จจริงนั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 63",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 63",
                                "description":"ถ้าผลของการกระทำความผิดใดทำให้ผู้กระทำต้องรับโทษหนักขึ้น ผลของการกระทำความผิดนั้นต้องเป็นผลที่ตามธรรมดาย่อมเกิดขึ้นได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 64",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 64",
                                "description":"บุคคลจะแก้ตัวว่าไม่รู้กฎหมายเพื่อให้พ้นจากความรับผิดในทางอาญาไม่ได้ แต่ถ้าศาลเห็นว่า ตามสภาพและพฤติการณ์ ผู้กระทำความผิดอาจจะไม่รู้ว่ากฎหมายบัญญัติว่าการกระทำนั้นเป็นความผิด ศาลอาจอนุญาตให้แสดงพยานหลักฐานต่อศาล และถ้าศาลเชื่อว่าผู้กระทำไม่รู้ว่ากฎหมายบัญญัติไว้เช่นนั้น ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 65",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 65",
                                "description":"ผู้ใดกระทำความผิด ในขณะไม่สามารถรู้ผิดชอบ หรือไม่สามารถบังคับตนเองได้เพราะมีจิตบกพร่อง โรคจิตหรือจิตฟั่นเฟือน ผู้นั้นไม่ต้องรับโทษสำหรับความผิดนั้น",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "แต่ถ้าผู้กระทำความผิดยังสามารถรู้ผิดชอบอยู่บ้าง หรือยังสามารถบังคับตนเองได้บ้าง ผู้นั้นต้องรับโทษสำหรับความผิดนั้น แต่ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 66",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 66",
                                "description":"ความมึนเมาเพราะเสพย์สุราหรือสิ่งเมาอย่างอื่นจะยกขึ้นเป็นข้อแก้ตัวตามมาตรา ๖๕ ไม่ได้ เว้นแต่ความมึนเมานั้นจะได้เกิดโดยผู้เสพย์ไม่รู้ว่าสิ่งนั้นจะทำให้มึนเมา หรือได้เสพย์โดยถูกขืนใจให้เสพย์ และได้กระทำความผิดในขณะไม่สามารถรู้ผิดชอบ หรือไม่สามารถบังคับตนเองได้ ผู้กระทำความผิดจึงจะได้รับยกเว้นโทษสำหรับความผิดนั้น แต่ถ้าผู้นั้นยังสามารถรู้ผิดชอบอยู่บ้าง หรือยังสามารถบังคับตนเองได้บ้าง ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 67",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 67",
                                "description":"ผู้ใดกระทำความผิดด้วยความจำเป็น",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content": "เพราะอยู่ในที่บังคับ หรือภายใต้อำนาจซึ่งไม่สามารถหลีกเลี่ยงหรือขัดขืนได้ หรือ"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content": "เพราะเพื่อให้ตนเองหรือผู้อื่นพ้นจากภยันตรายที่ใกล้จะถึงและไม่สามารถหลีกเลี่ยงให้พ้นโดยวิธีอื่นใดได้ เมื่อภยันตรายนั้นตนมิได้ก่อให้เกิดขึ้นเพราะความผิดของตน"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ถ้าการกระทำนั้นไม่เป็นการเกินสมควรแก่เหตุแล้ว ผู้นั้นไม่ต้องรับโทษ"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 68",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 68",
                                "description":"ผู้ใดจำต้องกระทำการใดเพื่อป้องกันสิทธิของตนหรือของผู้อื่นให้พ้นภยันตรายซึ่งเกิดจากการประทุษร้ายอันละเมิดต่อกฎหมาย และเป็นภยันตรายที่ใกล้จะถึง ถ้าได้กระทำพอสมควรแก่เหตุ การกระทำนั้นเป็นการป้องกันโดยชอบด้วยกฎหมาย ผู้นั้นไม่มีความผิด"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 69",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 69",
                                "description":"ในกรณีที่บัญญัติไว้ในมาตรา ๖๗ และมาตรา ๖๘ นั้น ถ้าผู้กระทำได้กระทำไปเกินสมควรแก่เหตุ หรือเกินกว่ากรณีแห่งความจำเป็น หรือเกินกว่ากรณีแห่งการจำต้องกระทำเพื่อป้องกัน ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้ แต่ถ้าการกระทำนั้นเกิดขึ้นจากความตื่นเต้น ความตกใจ หรือความกลัว ศาลจะไม่ลงโทษผู้กระทำก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 70",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 70",
                                "description":"ผู้ใดกระทำตามคำสั่งของเจ้าพนักงาน แม้คำสั่งนั้นจะมิชอบด้วยกฎหมาย ถ้าผู้กระทำมีหน้าที่หรือเชื่อโดยสุจริตว่ามีหน้าที่ต้องปฏิบัติตาม ผู้นั้นไม่ต้องรับโทษ เว้นแต่จะรู้ว่าคำสั่งนั้นเป็นคำสั่งซึ่งมิชอบด้วยกฎหมาย"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 71",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 71",
                                "description":"ความผิดตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๓๖ วรรคแรก และมาตรา ๓๔๑ ถึงมาตรา ๓๖๔ นั้น ถ้าเป็นการกระทำที่สามีกระทำต่อภริยา หรือภริยากระทำต่อสามี ผู้กระทำไม่ต้องรับโทษ",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ความผิดดังระบุมานี้ ถ้าเป็นการกระทำที่ผู้บุพการีกระทำต่อผู้สืบสันดาน ผู้สืบสันดานกระทำต่อผู้บุพการี หรือพี่หรือน้องร่วมบิดามารดาเดียวกันกระทำต่อกัน แม้กฎหมายมิได้บัญญัติให้เป็นความผิดอันยอมความได้ ก็ให้เป็นความผิดอันยอมความได้ และนอกจากนั้น ศาลจะลงโทษน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 72",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 72",
                                "description":"ผู้ใดบันดาลโทสะโดยถูกข่มเหงอย่างร้ายแรงด้วยเหตุอันไม่เป็นธรรม จึงกระทำความผิดต่อผู้ข่มเหงในขณะนั้น ศาลจะลงโทษผู้นั้นน้อยกว่าที่กฎหมายกำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 73",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 73",
                                "description":"เด็กอายุยังไม่เกินสิบสองปี กระทำการอันกฎหมายบัญญัติเป็นความผิด เด็กนั้นไม่ต้องรับโทษ",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ให้พนักงานสอบสวนส่งตัวเด็กตามวรรคหนึ่งให้พนักงานเจ้าหน้าที่ตามกฎหมายว่าด้วยการคุ้มครองเด็ก เพื่อดำเนินการคุ้มครองสวัสดิภาพตามกฎหมายว่าด้วยการนั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 74",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 74",
                                "description":"เด็กอายุกว่าสิบสองปีแต่ยังไม่เกินสิบห้าปี กระทําการอันกฎหมายบัญญัติเป็นความผิด เด็กนั้นไม่ต้องรับโทษ แต่ให้ศาลมีอํานาจที่จะดําเนินการ ดังต่อไปนี้",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "content": "ว่ากล่าวตักเตือนเด็กนั้นแล้วปล่อยตัวไป และถ้าศาลเห็นสมควรจะเรียกบิดา มารดา ผู้ปกครอง หรือบุคคลที่เด็กนั้นอาศัยอยู่มาตักเตือนด้วยก็ได้"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content": "ถ้าศาลเห็นว่าบิดา มารดา หรือผู้ปกครองสามารถดูแลเด็กนั้นได้ ศาลจะมีคําสั่งให้มอบตัวเด็กนั้นให้แก่บิดา มารดา หรือผู้ปกครองไป โดยวางข้อกําหนดให้บิดา มารดา หรือผู้ปกครองระวังเด็กนั้นไม่ให้ก่อเหตุร้ายตลอดเวลาที่ศาลกําหนดซึ่งต้องไม่เกินสามปีและกําหนดจํานวนเงินตามที่เห็นสมควรซึ่งบิดา มารดา หรือผู้ปกครองจะต้องชําระต่อศาลไม่เกินครั้งละหนึ่งหมื่นบาท ในเมื่อเด็กนั้นก่อเหตุร้ายขึ้น แต่ถ้าเด็กนั้นอาศัยอยู่กับบุคคลอื่นนอกจากบิดา มารดา หรือผู้ปกครอง และศาลเห็นว่าไม่สมควรจะเรียกบิดา มารดา หรือผู้ปกครองมาวางข้อกําหนดดังกล่าวข้างต้น ศาลจะเรียกตัวบุคคลที่เด็กนั้นอาศัยอยู่มาสอบถามว่าจะยอมรับข้อกําหนดทํานองที่บัญญัติไว้สําหรับบิดา มารดา หรือผู้ปกครองดังกล่าวมาข้างต้นหรือไม่ก็ได้ ถ้าบุคคลที่เด็กนั้นอาศัยอยู่ยอมรับข้อกําหนดเช่นว่านั้น ก็ให้ศาลมีคําสั่งมอบตัวเด็กให้แก่บุคคลนั้นไปโดยวางข้อกําหนดดังกล่าว"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content": "ส่งตัวเด็กนั้นไปยังสถานศึกษา หรือสถานฝึกและอบรม หรือสถานแนะนําทางจิต หรือสถานที่ซึ่งจัดตั้งขึ้นเพื่อฝึกและอบรมเด็ก ตลอดระยะเวลาที่ศาลกําหนด แต่ไม่ให้เกินกว่าวันที่เด็กนั้นจะมีอายุครบสิบแปดปี"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ในกรณีที่ศาลมอบตัวเด็กให้แก่บิดา มารดา ผู้ปกครอง หรือบุคคลที่เด็กนั้นอาศัยอยู่ตาม (๒) ศาลจะกําหนดเงื่อนไขเพื่อคุมความประพฤติเด็กนั้นเช่นเดียวกับที่บัญญัติไว้ในมาตรา ๕๖ ด้วยก็ได้ ในกรณีเช่นว่านี้ ให้ศาลแต่งตั้งพนักงานคุมประพฤติหรือพนักงานอื่นใดเพื่อคุมความประพฤติเด็กนั้น"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "ในกรณีที่เด็กนั้นไม่มีบิดา มารดา หรือผู้ปกครอง หรือมีแต่ศาลเห็นว่าไม่สามารถดูแลเด็กนั้นได้ หรือในกรณีที่เด็กอาศัยอยู่กับบุคคลอื่นนอกจากบิดา มารดา หรือผู้ปกครอง และบุคคลนั้นไม่ยอมรับข้อกําหนดดังกล่าวใน (๒) ศาลจะมีคําสั่งให้มอบตัวเด็กนั้นให้อยู่กับบุคคลหรือองค์การที่ศาลเห็นสมควร เพื่อดูแล อบรม และสั่งสอนตามระยะเวลาที่ศาลกําหนดก็ได้ในเมื่อบุคคลหรือองค์การนั้นยินยอม ในกรณีเช่นว่านี้ ให้บุคคลหรือองค์การนั้นมีอํานาจเช่นผู้ปกครองเฉพาะเพื่อดูแล อบรม และสั่งสอน รวมตลอดถึงการกําหนดที่อยู่และการจัดให้เด็กมีงานทําตามสมควรหรือให้ดําเนินการคุ้มครองสวัสดิภาพเด็กตามกฎหมายว่าด้วยการนั้นก็ได้"
                                    },
                                    {
                                        "partTitle":"วรรค 4",
                                        "content": "คําสั่งของศาลดังกล่าวใน (๒) (๓) วรรคสอง และวรรคสามนั้น ถ้าในขณะใดภายในระยะเวลาที่ศาลกําหนดไว้ ความปรากฏแก่ศาลโดยศาลรู้เองหรือตามคําเสนอของผู้มีส่วนได้เสีย พนักงานอัยการ หรือบุคคลหรือองค์การที่ศาลมอบตัวเด็กเพื่อดูแล อบรม และสั่งสอน หรือเจ้าพนักงานว่าพฤติการณ์เกี่ยวกับคําสั่งนั้นได้เปลี่ยนแปลงไป ก็ให้ศาลมีอํานาจเปลี่ยนแปลงแก้ไขคําสั่งนั้นหรือมีคําสั่งใหม่ตามอํานาจในมาตรานี้"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 75",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 75",
                                "description":"ผู้ใดอายุกว่าสิบห้าปีแต่ต่ำกว่าสิบแปดปี กระทำการอันกฎหมายบัญญัติเป็นความผิด ให้ศาลพิจารณาถึงความรู้ผิดชอบและสิ่งอื่นทั้งปวงเกี่ยวกับผู้นั้น ในอันที่จะควรวินิจฉัยว่าสมควรพิพากษาลงโทษผู้นั้นหรือไม่ ถ้าศาลเห็นว่าไม่สมควรพิพากษาลงโทษก็ให้จัดการตามมาตรา ๗๔ หรือถ้าศาลเห็นว่าสมควรพิพากษาลงโทษ ก็ให้ลดมาตราส่วนโทษที่กำหนดไว้สำหรับความผิดลงกึ่งหนึ่ง"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 76",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 76",
                                "description":"ผู้ใดอายุตั้งแต่สิบแปดปีแต่ยังไม่เกินยี่สิบปี กระทำการอันกฎหมายบัญญัติเป็นความผิด ถ้าศาลเห็นสมควรจะลดมาตราส่วนโทษที่กำหนดไว้สำหรับความผิดนั้นลงหนึ่งในสามหรือกึ่งหนึ่งก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 77",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 77",
                                "description":"ในกรณีที่ศาลวางข้อกำหนดให้บิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ ระวังเด็กนั้นไม่ให้ก่อเหตุร้ายตามความในมาตรา ๗๔ (๒) ถ้าเด็กนั้นก่อเหตุร้ายขึ้นภายในเวลาในข้อกำหนด ศาลมีอำนาจบังคับบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ ให้ชำระเงินไม่เกินจำนวนในข้อกำหนดนั้น ภายในเวลาที่ศาลเห็นสมควร ถ้าบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ไม่ชำระเงิน ศาลจะสั่งให้ยึดทรัพย์สินของบิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ เพื่อใช้เงินที่จะต้องชำระก็ได้",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ในกรณีที่ศาลได้บังคับให้บิดามารดา ผู้ปกครองหรือบุคคลที่เด็กนั้นอาศัยอยู่ชำระเงินตามข้อกำหนดแล้วนั้น ถ้าศาลมิได้เปลี่ยนแปลงแก้ไขคำสั่งที่ได้วางข้อกำหนดนั้นเป็นอย่างอื่นตามความในมาตรา ๗๔ วรรคท้าย ก็ให้ข้อกำหนดนั้นคงใช้บังคับได้ต่อไปจนสิ้นเวลาที่กำหนดไว้ในข้อกำหนดนั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 78",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 78",
                                "description":"เมื่อปรากฏว่ามีเหตุบรรเทาโทษ ไม่ว่าจะได้มีการเพิ่มหรือการลดโทษตามบทบัญญัติแห่งประมวลกฎหมายนี้หรือกฎหมายอื่นแล้วหรือไม่ ถ้าศาลเห็นสมควรจะลดโทษไม่เกินกึ่งหนึ่งของโทษที่จะลงแก่ผู้กระทำความผิดนั้นก็ได้",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "เหตุบรรเทาโทษนั้น ได้แก่ผู้กระทำความผิดเป็นผู้โฉดเขลาเบาปัญญาตกอยู่ในความทุกข์อย่างสาหัส มีคุณความดีมาแต่ก่อน รู้สึกความผิดและพยายามบรรเทาผลร้ายแห่งความผิดนั้น ลุแก่โทษต่อเจ้าพนักงานหรือให้ความรู้แก่ศาลอันเป็นประโยชน์แก่การพิจารณา หรือเหตุอื่นที่ศาลเห็นว่ามีลักษณะทำนองเดียวกัน"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 79",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 79",
                                "description":"ในคดีที่มีโทษปรับสถานเดียว ถ้าผู้ที่ต้องหาว่ากระทำความผิด นำค่าปรับในอัตราอย่างสูงสำหรับความผิดนั้นมาชำระก่อนที่ศาลเริ่มต้นสืบพยาน ให้คดีนั้นเป็นอันระงับไป"
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 5 การพยายามกระทำความผิด",
                "subsections":[
                    {
                        "subsectionTitle":"มาตรา 80",
                        "articles": [
                            {
                                "articleNumber": "มาตรา 80",
                                "description": "ผู้ใดลงมือกระทำความผิดแต่กระทำไปไม่ตลอด หรือกระทำไปตลอดแล้วแต่การกระทำนั้นไม่บรรลุผล ผู้นั้นพยายามกระทำความผิด",
                                "splitSections" :[
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ผู้ใดพยายามกระทำความผิด ผู้นั้นต้องระวางโทษสองในสามส่วนของโทษที่กฎหมายกำหนดไว้สำหรับความผิดนั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 81",
                        "articles": [
                            {
                                "articleNumber": "มาตรา 81",
                                "description": "ผู้ใดกระทำการโดยมุ่งต่อผลซึ่งกฎหมายบัญญัติเป็นความผิด แต่การกระทำนั้นไม่สามารถจะบรรลุผลได้อย่างแน่แท้ เพราะเหตุปัจจัยซึ่งใช้ในการกระทำหรือเหตุแห่งวัตถุที่มุ่งหมายกระทำต่อ ให้ถือว่าผู้นั้นพยายามกระทำความผิด แต่ให้ลงโทษไม่เกินกึ่งหนึ่งของโทษที่กฎหมายกำหนดไว้สำหรับความผิดนั้น",
                                "splitSections" :[
                                    {
                                        "partTitle": "วรรค 2",
                                        "content": "ถ้าการกระทำดังกล่าวในวรรคแรกได้กระทำไปโดยความเชื่ออย่างงมงาย ศาลจะไม่ลงโทษก็ได้"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 82",
                        "articles": [
                            {
                                "articleNumber": "มาตรา 82",
                                "description": "ผู้ใดพยายามกระทำความผิด หากยับยั้งเสียเองไม่กระทำการให้ตลอด หรือกลับใจแก้ไขไม่ให้การกระทำนั้นบรรลุผล ผู้นั้นไม่ต้องรับโทษสำหรับการพยายามกระทำความผิดนั้น แต่ถ้าการที่ได้กระทำไปแล้วต้องตามบทกฎหมายที่บัญญัติเป็นความผิด ผู้นั้นต้องรับโทษสำหรับความผิดนั้น ๆ"
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 6 ตัวการและผู้สนับสนุน",
                "subsections":[
                    {
                        "subsectionTitle":"มาตรา 83",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 83",
                                "description": "ในกรณีความผิดใดเกิดขึ้นโดยการกระทำของบุคคลตั้งแต่สองคนขึ้นไป ผู้ที่ได้ร่วมกระทำความผิดด้วยกันนั้นเป็นตัวการ ต้องระวางโทษตามที่กฎหมายกำหนดไว้สำหรับความผิดนั้น"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 84",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 84",
                                "description": "ผู้ใดก่อให้ผู้อื่นกระทำความผิดไม่ว่าด้วยการใช้ บังคับ ขู่เข็ญ จ้าง วานหรือยุยงส่งเสริม หรือด้วยวิธีอื่นใด ผู้นั้นเป็นผู้ใช้ให้กระทำความผิด",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ถ้าความผิดมิได้กระทำลงไม่ว่าจะเป็นเพราะผู้ถูกใช้ไม่ยอมกระทำ ยังไม่ได้กระทำ หรือเหตุอื่นใด ผู้ใช้ต้องระวางโทษเพียงหนึ่งในสามของโทษที่กำหนดไว้สำหรับความผิดนั้น"
                                    },
                                    {
                                        "partTitle":"วรรค 3",
                                        "content": "ถ้าผู้ถูกใช้ได้กระทำความผิดนั้น ผู้ใช้ต้องรับโทษเสมือนเป็นตัวการ และถ้าผู้ถูกใช้เป็นบุคคลอายุไม่เกินสิบแปดปี ผู้พิการ ผู้ทุพพลภาพ ลูกจ้างหรือผู้ที่อยู่ใต้บังคับบัญชาของผู้ใช้ ผู้ที่มีฐานะยากจน หรือผู้ต้องพึ่งพาผู้ใช้เพราะเหตุป่วยเจ็บหรือไม่ว่าทางใด ให้เพิ่มโทษที่จะลงแก่ผู้ใช้กึ่งหนึ่งของโทษที่ศาลกำหนดสำหรับผู้นั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 85",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 85",
                                "description": "ผู้ใดโฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด และความผิดนั้นมีกำหนดโทษไม่ต่ำกว่าหกเดือน ผู้นั้นต้องระวางโทษกึ่งหนึ่งของโทษที่กำหนดไว้สำหรับความผิดนั้น",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": "ถ้าได้มีการกระทำความผิดเพราะเหตุที่ได้มีการโฆษณาหรือประกาศตามความในวรรคแรก ผู้โฆษณาหรือประกาศต้องรับโทษเสมือนเป็นตัวการ"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 85/1",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 85/1",
                                "description": "ถ้าผู้ถูกใช้ตามมาตรา ๘๔ หรือผู้กระทำตามคำโฆษณา หรือประกาศแก่บุคคลทั่วไปให้กระทำความผิดตามมาตรา ๘๕ ได้ให้ข้อมูลสำคัญอันเป็นการเปิดเผยถึงการกระทำความผิดของผู้ใช้ให้กระทำความผิดหรือผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด และเป็นประโยชน์อย่างยิ่งต่อการดำเนินคดีแก่บุคคลดังกล่าว ศาลจะลงโทษผู้นั้นน้อยกว่าอัตราโทษขั้นต่ำที่กำหนดไว้สำหรับความผิดนั้นเพียงใดก็ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 86",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 86",
                                "description": "ผู้ใดกระทำด้วยประการใด ๆ อันเป็นการช่วยเหลือ หรือให้ความสะดวกในการที่ผู้อื่นกระทำความผิดก่อนหรือขณะกระทำความผิด แม้ผู้กระทำความผิดจะมิได้รู้ถึงการช่วยเหลือหรือให้ความสะดวกนั้นก็ตาม ผู้นั้นเป็นผู้สนับสนุนการกระทำความผิด ต้องระวางโทษสองในสามส่วนของโทษที่กำหนดไว้สำหรับความผิดที่สนับสนุนนั้น"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 87",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 87",
                                "description": "ในกรณีที่มีการกระทำความผิดเพราะมีผู้ใช้ให้กระทำตามมาตรา ๘๔ เพราะมีผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิดตามมาตรา ๘๕ หรือโดยมีผู้สนับสนุนตามมาตรา ๘๖ ถ้าความผิดที่เกิดขึ้นนั้น ผู้กระทำได้กระทำไปเกินขอบเขตที่ใช้หรือที่โฆษณาหรือประกาศ หรือเกินไปจากเจตนาของผู้สนับสนุน ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาเพียงสำหรับความผิดเท่าที่อยู่ในขอบเขตที่ใช้ หรือที่โฆษณาหรือประกาศ หรืออยู่ในขอบเขตแห่งเจตนาของผู้สนับสนุนการกระทำความผิดเท่านั้น แต่ถ้าโดยพฤติการณ์อาจเล็งเห็นได้ว่า อาจเกิดการกระทำความผิดเช่นที่เกิดขึ้นนั้นได้จากการใช้ การโฆษณา หรือประกาศ หรือการสนับสนุน ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาตามความผิดที่เกิดขึ้นนั้น",
                                "splitSections":[
                                    {
                                        "partTitle":"วรรค 2",
                                        "content": " ในกรณีที่ผู้ถูกใช้ ผู้กระทำตามคำโฆษณา หรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือตัวการในความผิด จะต้องรับผิดทางอาญามีกำหนดโทษสูงขึ้นเพราะอาศัยผลที่เกิดจากการกระทำความผิด ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด แล้วแต่กรณี ต้องรับผิดทางอาญาตามความผิดที่มีกำหนดโทษสูงขึ้นนั้นด้วย แต่ถ้าโดยลักษณะของความผิด ผู้กระทำจะต้องรับผิดทางอาญามีกำหนดโทษสูงขึ้นเฉพาะเมื่อผู้กระทำต้องรู้ หรืออาจเล็งเห็นได้ว่าจะเกิดผลเช่นนั้นขึ้น ผู้ใช้ให้กระทำความผิด ผู้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำความผิด หรือผู้สนับสนุนการกระทำความผิด จะต้องรับผิดทางอาญาตามความผิดที่มีกำหนดโทษสูงขึ้นก็เฉพาะเมื่อตนได้รู้ หรืออาจเล็งเห็นได้ว่าจะเกิดผลเช่นที่เกิดขึ้นนั้น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 88",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 88",
                                "description": "ถ้าความผิดที่ได้ใช้ ที่ได้โฆษณาหรือประกาศแก่บุคคลทั่วไปให้กระทำ หรือที่ได้สนับสนุนให้กระทำ ได้กระทำถึงขั้นลงมือกระทำความผิด แต่เนื่องจากการเข้าขัดขวางของผู้ใช้ ผู้โฆษณาหรือประกาศ หรือผู้สนับสนุน ผู้กระทำได้กระทำไปไม่ตลอด หรือกระทำไปตลอดแล้ว แต่การกระทำนั้นไม่บรรลุผล ผู้ใช้หรือผู้โฆษณาหรือประกาศ คงรับผิดเพียงที่บัญญัติไว้ในมาตรา ๘๔ วรรคสอง หรือมาตรา ๘๕ วรรคแรก แล้วแต่กรณี ส่วนผู้สนับสนุนนั้นไม่ต้องรับโทษ"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 89",
                        "articles": [
                            {
                                "articleNumber":"มาตรา 89",
                                "description": "ถ้ามีเหตุส่วนตัวอันควรยกเว้นโทษ ลดโทษหรือเพิ่มโทษแก่ผู้ระทำความผิดคนใด จะนำเหตุนั้นไปใช้แก่ผู้กระทำความผิดคนอื่นในการกระทำความผิดนั้นด้วยไม่ได้ แต่ถ้าเหตุอันควรยกเว้นโทษ ลดโทษหรือเพิ่มโทษเป็นเหตุในลักษณะคดี จึงให้ใช้แก่ผู้กระทำความผิดในการกระทำความผิดนั้นด้วยกันทุกคน"
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 7 การกระทำความผิดหลายบทหรือหลายกระทง",
                "subsections": [
                    {
                        "subsectionTitle":"มาตรา 90",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 90",
                                "description": "เมื่อการกระทำใดอันเป็นกรรมเดียวเป็นความผิดต่อกฎหมายหลายบท ให้ใช้กฎหมายบทที่มีโทษหนักที่สุดลงโทษแก่ผู้กระทำความผิด"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 91",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 91",
                                "description": "เมื่อปรากฏว่าผู้ใดได้กระทำการอันเป็นความผิดหลายกรรมต่างกัน ให้ศาลลงโทษผู้นั้นทุกกรรมเป็นกระทงความผิดไป แต่ไม่ว่าจะมีการเพิ่มโทษ ลดโทษ หรือลดมาตราส่วนโทษด้วยหรือไม่ก็ตาม เมื่อรวมโทษทุกกระทงแล้ว โทษจำคุกทั้งสิ้นต้องไม่เกินกำหนดดังต่อไปนี้",
                                "splitSections":[
                                    {
                                        "partTitle": "(1)",
                                        "content": "สิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงไม่เกินสามปี"
                                    },
                                    {
                                        "partTitle": "(2)",
                                        "content": "ยี่สิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงเกินสามปีแต่ไม่เกินสิบปี"
                                    },
                                    {
                                        "partTitle": "(3)",
                                        "content": "ห้าสิบปี สำหรับกรณีความผิดกระทงที่หนักที่สุดมีอัตราโทษจำคุกอย่างสูงเกินสิบปีขึ้นไป เว้นแต่กรณีที่ศาลลงโทษจำคุกตลอดชีวิต"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "sectionTitle":"หมวด 8 การกระทำความผิดอีก",
                "subsections":[
                    {
                        "subsectionTitle":"มาตรา 92",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 92",
                                "description": "ผู้ใดต้องคำพิพากษาถึงที่สุดให้ลงโทษจำคุก ถ้าและได้กระทำความผิดใด ๆ อีกในระหว่างที่ยังจะต้องรับโทษอยู่ก็ดี ภายในเวลาห้าปีนับแต่วันพ้นโทษก็ดี หากศาลจะพิพากษาลงโทษครั้งหลังถึงจำคุก ก็ให้เพิ่มโทษที่จะลงแก่ผู้นั้นหนึ่งในสามของโทษที่ศาลกำหนดสำหรับความผิดครั้งหลัง"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 93",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 93",
                                "description": "ผู้ใดต้องคำพิพากษาถึงที่สุดให้ลงโทษจำคุก ถ้าและได้กระทำความผิดอย่างหนึ่งอย่างใดที่จำแนกไว้ในอนุมาตราต่อไปนี้ซ้ำในอนุมาตราเดียวกันอีกในระหว่างที่ยังจะต้องรับโทษอยู่ก็ดี ภายในเวลาสามปีนับแต่วันพ้นโทษก็ดี ถ้าความผิดครั้งแรกเป็นความผิดซึ่งศาลพิพากษาลงโทษจำคุกไม่น้อยกว่าหกเดือน หากศาลจะพิพากษาลงโทษครั้งหลังถึงจำคุก ก็ให้เพิ่มโทษที่จะลงแก่ผู้นั้นกึ่งหนึ่งของโทษที่ศาลกำหนดสำหรับความผิดครั้งหลัง",
                                "splitSections": [
                                    {
                                        "partTitle":"(1)",
                                        "content":"ความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักร ตามที่บัญญัติไว้ในมาตรา ๑๐๗ ถึงมาตรา ๑๓๕"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "content":"ความผิดต่อเจ้าพนักงาน ตามที่บัญญัติไว้ในมาตรา ๑๓๖ ถึงมาตรา ๑๔๖"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "content":"ความผิดต่อตำแหน่งหน้าที่ราชการ ตามที่บัญญัติไว้ในมาตรา ๑๔๗ ถึงมาตรา ๑๖๖"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "content":"ความผิดต่อเจ้าพนักงานในการยุติธรรม ตามที่บัญญัติไว้ในมาตรา ๑๖๗ ถึงมาตรา ๑๙๒ และมาตรา ๑๙๔"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "content":"ความผิดต่อตำแหน่งหน้าที่ในการยุติธรรม ตามที่บัญญัติไว้ในมาตรา ๒๐๐ ถึงมาตรา ๒๐๔"
                                    },
                                    {
                                        "partTitle":"(6)",
                                        "content":"ความผิดเกี่ยวกับความสงบสุขของประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๐๙ ถึงมาตรา ๒๑๖"
                                    },
                                    {
                                        "partTitle":"(7)",
                                        "content":"ความผิดเกี่ยวกับการก่อให้เกิดภยันตรายต่อประชาชน ตามที่บัญญัติไว้ในมาตรา ๒๑๗ ถึงมาตรา ๒๒๔ มาตรา ๒๒๖ ถึงมาตรา ๒๓๔ และมาตรา ๒๓๖ ถึงมาตรา ๒๓๘"
                                    },
                                    {
                                        "partTitle":"(8)",
                                        "content":"ความผิดเกี่ยวกับเงินตรา ตามที่บัญญัติไว้ในมาตรา ๒๔๐ ถึงมาตรา ๒๔๙ ความผิดเกี่ยวกับดวงตราแสตมป์และตั๋ว ตามที่บัญญัติไว้ในมาตรา ๒๕๐ ถึงมาตรา ๒๖๑ และความผิดเกี่ยวกับเอกสาร ตามที่บัญญัติไว้ในมาตรา ๒๖๔ ถึงมาตรา ๒๖๙"
                                    },
                                    {
                                        "partTitle":"(9)",
                                        "content":"ความผิดเกี่ยวกับการค้า ตามที่บัญญัติไว้ในมาตรา ๒๗๐ ถึงมาตรา ๒๗๕"
                                    },
                                    {
                                        "partTitle":"(10)",
                                        "content":"ความผิดเกี่ยวกับเพศ ตามที่บัญญัติไว้ในมาตรา ๒๗๖ ถึงมาตรา ๒๘๕"
                                    },
                                    {
                                        "partTitle":"(11)",
                                        "content":"ความผิดต่อชีวิต ตามที่บัญญัติไว้ในมาตรา ๒๘๘ ถึงมาตรา ๒๙๐ และมาตรา ๒๙๔ ความผิดต่อร่างกาย ตามที่บัญญัติไว้ในมาตรา ๒๙๕ ถึงมาตรา ๒๙๙ ความผิดฐานทำให้แท้งลูก ตามที่บัญญัติไว้ในมาตรา ๓๐๑ ถึงมาตรา ๓๐๓ และความผิดฐานทอดทิ้งเด็ก คนป่วย เจ็บหรือคนชรา ตามที่บัญญัติไว้ในมาตรา ๓๐๖ ถึงมาตรา ๓๐๘"
                                    },
                                    {
                                        "partTitle":"(12)",
                                        "content":"ความผิดต่อเสรีภาพ ตามที่บัญญัติไว้ในมาตรา ๓๐๙ มาตรา ๓๑๐ และมาตรา ๓๑๒ ถึงมาตรา ๓๒๐"
                                    },
                                    {
                                        "partTitle":"(13)",
                                        "content":"ความผิดเกี่ยวกับทรัพย์ ตามที่บัญญัติไว้ในมาตรา ๓๓๔ ถึงมาตรา ๓๖๕"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 94",
                        "articles":[
                            {
                                "articleNumber":"มาตรา 94",
                                "description": "ความผิดอันได้กระทำโดยประมาท ความผิดลหุโทษ และความผิดซึ่งผู้กระทำได้กระทำในขณะที่มีอายุต่ำกว่าสิบแปดปีนั้น ไม่ว่าจะได้กระทำในครั้งก่อนหรือครั้งหลัง ไม่ถือว่าเป็นความผิดเพื่อการเพิ่มโทษตามความในหมวดนี้"
                            }
                        ]
                    }
                    
                ]
            },
            {
                "sectionTitle":"หมวด 9 อายุความ",
                "subsections":[
                    {
                        "subsectionTitle":"มาตรา 95",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 95",
                                "description":"ในคดีอาญา ถ้ามิได้ฟ้องและได้ตัวผู้กระทำความผิดมายังศาลภายในกำหนดดังต่อไปนี้ นับแต่วันกระทำความผิด เป็นอันขาดอายุความ",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "context": "ยี่สิบปี สำหรับความผิดต้องระวางโทษประหารชีวิต จำคุกตลอดชีวิต หรือจำคุกยี่สิบปี"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "context": "สิบห้าปี สำหรับความผิดต้องระวางโทษจำคุกกว่าเจ็ดปีแต่ยังไม่ถึงยี่สิบปี"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "context": "สิบปี สำหรับความผิดต้องระวางโทษจำคุกกว่าหนึ่งปีถึงเจ็ดปี"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "context": "ห้าปี สำหรับความผิดต้องระวางโทษจำคุกกว่าหนึ่งเดือนถึงหนึ่งปี"
                                    },
                                    {
                                        "partTitle":"(5)",
                                        "context": "หนึ่งปี สำหรับความผิดต้องระวางโทษจำคุกตั้งแต่หนึ่งเดือนลงมา หรือต้องระวางโทษอย่างอื่น"
                                    },
                                    {
                                        "partTitle":"วรรค 2",
                                        "context": "ถ้าได้ฟ้องและได้ตัวผู้กระทำความผิดมายังศาลแล้ว ผู้กระทำความผิดหลบหนีหรือวิกลจริต และศาลสั่งงดการพิจารณาไว้จนเกินกำหนดดังกล่าวแล้วนับแต่วันที่หลบหนีหรือวันที่ศาลสั่งงดการพิจารณา ก็ให้ถือว่าเป็นอันขาดอายุความเช่นเดียวกัน"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 96",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 96",
                                "description":"ในคดีอาญา ถ้ามิได้ฟ้องและได้ตัวผู้กระทำความผิดมายังศาลภายในกำหนดดังต่อไปนี้ นับแต่วันกระทำความผิด เป็นอันขาดอายุความ"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 97",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 97",
                                "description":"ในการฟ้องขอให้กักกัน ถ้าจะฟ้องภายหลังการฟ้องคดีอันเป็นมูลให้เกิดอำนาจฟ้องขอให้กักกัน ต้องฟ้องภายในกำหนดหกเดือนนับแต่วันที่ฟ้องคดีนั้น มิฉะนั้น เป็นอันขาดอายุความ"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 98",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 98",
                                "description":"เมื่อได้มีคำพิพากษาถึงที่สุดให้ลงโทษผู้ใด ผู้นั้นยังมิได้รับโทษก็ดี ได้รับโทษแต่ยังไม่ครบถ้วนโดยหลบหนีก็ดี ถ้ายังมิได้ตัวผู้นั้นมาเพื่อรับโทษนับแต่วันที่มีคำพิพากษาถึงที่สุด หรือนับแต่วันที่ผู้กระทำความผิดหลบหนี แล้วแต่กรณี เกินกำหนดเวลาดังต่อไปนี้ เป็นอันล่วงเลยการลงโทษ จะลงโทษผู้นั้นมิได้",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "context":"ยี่สิบปี สำหรับโทษประหารชีวิต จำคุกตลอดชีวิตหรือจำคุกยี่สิบปี"
                                    },
                                    {
                                        "partTitle":"(2)",
                                        "context":"สิบห้าปี สำหรับโทษจำคุกกว่าเจ็ดปีแต่ยังไม่ถึงยี่สิบปี"
                                    },
                                    {
                                        "partTitle":"(3)",
                                        "context":"สิบปี สำหรับโทษจำคุกกว่าหนึ่งปีถึงเจ็ดปี"
                                    },
                                    {
                                        "partTitle":"(4)",
                                        "context":"ห้าปี สำหรับโทษจำคุกตั้งแต่หนึ่งปีลงมาหรือโทษอย่างอื่น"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 99",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 99",
                                "description":"การยึดทรัพย์สินหรืออายัดสิทธิเรียกร้องในทรัพย์สินเพื่อใช้ค่าปรับหรือการกักขังแทนค่าปรับ ถ้ามิได้ทำภายในกำหนดห้าปีนับแต่วันที่ได้มีคำพิพากษาถึงที่สุด จะยึดทรัพย์สิน อายัดสิทธิเรียกร้องในทรัพย์สิน หรือกักขังไม่ได้",
                                "splitSections":[
                                    {
                                        "partTitle":"(1)",
                                        "context": "ความในวรรคหนึ่งมิให้ใช้บังคับในกรณีการกักขังแทนค่าปรับซึ่งทำต่อเนื่องกับการลงโทษจำคุก"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 100",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 100",
                                "description":"เมื่อได้มีคำพิพากษาถึงที่สุดให้กักกันผู้ใด ถ้าผู้นั้นยังมิได้รับการกักกันก็ดี ได้รับการกักกันแต่ยังไม่ครบถ้วนโดยหลบหนีก็ดี ถ้าพ้นกำหนดสามปีนับแต่วันที่พ้นโทษ โดยได้รับโทษตามคำพิพากษาแล้วหรือโดยล่วงเลยการลงโทษ หรือนับแต่วันที่ผู้นั้นหลบหนีระหว่างเวลาที่ต้องกักกัน เป็นอันล่วงเลยการกักกัน จะกักกันผู้นั้นไม่ได้"
                            }
                        ]
                    },
                    {
                        "subsectionTitle":"มาตรา 101",
                        "articles":[
                            {
                                "articleTitle":"มาตรา 101",
                                "description":"การบังคับตามคำสั่งของศาลตามความในมาตรา ๔๖ หรือการร้องขอให้ศาลสั่งให้ใช้เงินเมื่อผู้ทำทัณฑ์บนประพฤติผิดทัณฑ์บนตามความในมาตรา ๔๗ นั้น ถ้ามิได้บังคับหรือร้องขอภายในกำหนดสองปีนับแต่วันที่ศาลมีคำสั่ง หรือนับแต่วันที่ผู้ทำทัณฑ์บนประพฤติผิดทัณฑ์บน จะบังคับหรือร้องขอมิได้"
                            }
                        ]
                    }
                ]
            }
        ],
        "category":"ลักษณะ 2 บทบัญญัติที่ใช้แก่ความผิดทั่วไป",
        
}